["What is your favorite childhood memory?", "How would you like to celebrate your 100th birthday?", "What would you title your autobiography?", "What did you learn about marriage from your parents?(both good and bad)", "You’re stuck in an elevator for four hours. What items do you wish you had?", "What event are you looking forward to?", "What would you like to accomplish in the next two years?", "To whom do you want to say \"thank you\" Why?", "Where is your favorite spot in our home?", "You want an unusual pet. What do you choose?", "What is the scariest thing you’ve ever done?", "What one thing would you like to change about yourself?", "If you could change your name, what would you choose?", "What new sex position would you like to try?", "You want to surprise your spouse with sex in an unusual place.  Where would that be?", "What made you fall in love with me?", "They are making a movie about your life. Who plays you? Who plays me?", "What was your favorite toy as a child? What is your favorite “grownup toy”?", "What was your favorite subject in school? Least favorite?", "Who is the kindest person you have ever met?", "If you could redo college would you choose the same major?", "If you could be someone else for a week, who would you choose?", "What is your favorite family tradition?", "If you had to eat dinner at the same restaurant for a month, which would you pick?", "Where in the world would you like to live?", "What fact about yourself is little known?", "What about you is like your mom?", "You’re creating a chocolate covered dessert. What’s under the chocolate?", "What bit of advice would you give to yourself at the age of 16?\t", "What 3 words best describe your life?\t", "What large item purchase would you like to save for?", "What is something you would like to learn?", "What do you own that would be hard to share or give away?", "What do I wear that you find sexy?", "What new couple or family tradition would you like to start?", "What dream do you have that you haven’t started to make come true?", "What do you like best about being your current age?\t", "What is your favorite word?Least favorite word?\t", "What qualities do you look for when picking friends?\t", "The last time you laughed, what was so funny?", "What one thing has been hard to forgive?\t", "What one skill would you like to improve?", "With whom would you like to have a conversati on (no time or distance limits)?", "You can invite anyone over for dinner. Who do you choose?", "What would you like to be famous for?", "What is the hardest thing you’ve ever done?", "What do you want to do on our 50th wedding anniversary?", "What about you is like your dad?", "If you could witness a historic event, what would you choose?", "What motivates you to get out of bed each morning?", "What small change would improve your spiritual walk?", "What legacy do you want to leave your children?", "Where is your favorite place to cuddle?", "You get to design the perfect (for you) backyard. What does it look like?", "Who is your mentor? Who do you mentor?", "What five things do you like that start with the letter “R”?", "What is the best advice anyone has given you?", "What do you remember about last year?", "Do you prefer making love with the lights on or off?", "What five things do you like that start with the letter “C”?", "What interesting event have you witnessed?", "What rule would you create to make the world a better place?", "What do you think people think of you?", "What tempts you?", "What were your grades like in school?", "What has been the hardest season of your life?", "Do you think people can control their own destiny?", "What do you want to be like when you are 80?", "What do i need to do to show you encouragement?", "If you were an animal, what would you be and why?", "What do you need to say “no” to?", "How can I communicate to you that you are special?", "What new hobby would you like to try?", "What would you like for a nickname?", "What do you feel qualified to teach?", "What do you value more- honesty or kindness?", "What would you like to eat for dinner tomorrow?", "What’s your favorite section of your favorite store?", "What is the most interesting or unique thing that you own?", "You’re opening a restaurant. What kind of restaurant?", "What’s your signature meal?", "What day in your life would you like to live over again?", "You wake up ten years in the future. What does you life look like?", "Who was your favorite teacher in high school? Why?", "If you were independently wealthy, how would you spend your time?", "Your house is on fire. What do you grab on your way out the door?", "What language would you like to learn?", "What do you think about keeping secrets?", "What does our future look like to you?", "What part of me are you most physically attracted to?", "What is your biggest fear?", "If you knew you would die tomorrow, would you feel cheated today?", "What is your favorite song?", "What gifts do you like?", "What concerns do you have that I do not seem interested in?", "Your friend loses their spouse. What do you say or do?", "What are some or your favorite websites?", "What’s the most money you’ve ever given away?", "What’s the stupidest thing you’ve ever done?", "You want to create a team for a project. What’s the project? Who’s on the team?", "Who are our neighbors?", "What question would you like to ask me?", "What do you consider when you make decisions?", "How do you act when someone hurts your feelings?", "What is holding you back?", "What do you do well?", "Other than me, who are your best friends? Why do you like them?", "What one small thing could you do to be more organized?", "You want to have a fun party with friends. What is the theme?", "What did you learn about sex from your friends and culture?", "In what ways do you feel rich? Poor?", "For what are you grateful?", "How do you recharge after a hard or stressful week?", "What did you learn from your first job?", "What was your first job?", "Your parents can no longer live on their own. What do you do?", "What is your favorite commercial?", "What do you like about our marriage?", "When was the last time you were embarrassed?", "If you were going to get a tattoo, what would it look like?", "If you have a tattoo do you regret getting it?", "Who do you pray for the most?", "What is on your list of things you want for Christmas?", "What rule do you think needs to be broken?", "You’ve run away from home to join the circus. What is your job?", "What do you like best about being male/female?", "If you had to play a part in a movie, what movie would you choose? What role?", "What makes you smile?", "What is the most creative thing you’ve ever done?", "What one thing can I do to build my friendship with you?", "What makes you feel safe?", "How do you describe God?", "How do you influence your friends?", "What is your greatest need?", "What would be your dream job?", "What do you know a lot about?", "How are you unique?", "What discourages you?", "What speaks love to you?", "What makes you cry?", "What is your favorite blog?", "Where do you turn for comfort?", "What do you love about your life?", "What makes you feel confident?", "What group would you like to join?", "Are you a religious person?", "Where do you find your worth?", "What is valuable to you?", "What makes our house a home?", "Who was your best friend when you were a kid? What were they like?", "What story about your life do you enjoy telling?", "Have you ever done anything illegal?", "What is your favorite day of the week? Why?", "You look up into the night sky and see a shooting star. What do you wish?", "You climb a giant beanstalk. What do you find at the top?", "What’s one thing on your “bucket list”?", "What weird or unusual food would you be willing to try?", "What is something you need to organize?", "What is something you tell yourself?", "You look into the mirror and it opens into another world. What does it look like? Would you visit?", "What is your favorite way to flirt with me?", "When you were a kid what did you want to be when you grew up?", "What is your favorite color?", "What could you cut out of your life that would make your life more sane?", "Whose marriage do you admire? Why?", "How can I pray for you?", "Have you ever broken any bones?", "If I don’t come out and say it, how do you know I want to have sex?", "What do I do that irritates you?", "Tell me something about you that I don’t know.", "How would you explain your basic life philosophy?", "Have you ever been in a fist fight?", "Would you rather be hated or forgotten?", "What achievement in your life is important to you?", "Do you vote? Why or why not?", "What’s the first thing you notice about people?", "Would you kill an innocent person if you thought it might mean saving a dozen other people?", "What makes you feel overwhelmed?", "You’re painting a picture. What is the subject of that picture?", "What is your happiest memory that includes me?", "What or who encourages you to be a better person?", "What toy did you wish for, but not get as child?", "Name all the “hats” you wear?", "In what ways do you feel old? Young?", "What question do you want to ask God?", "Who do you trust?", "What advice would you give someone just graduating from high school?", "What is challenging or difficult about being a wife/husband?", "What is something you avoid?", "What do you do when you know someone is angry with you?", "What do you think heaven will be like?", "For what item would you be willing to stand in line more than four hours to buy?", "You’ve just heard a bad rumor about a friend. What do you do?", "With whom are you angry?", "If you could live in any time in history, what would you choose?", "What is the most unusual thing you’ve ever eaten?", "What place do you NEVER want to visit?", "What risks are you taking?", "You’re procrastinating. What do you need to motivate you to get the job done?", "What is the biggest mistake you’ve ever made?", "Who is the most inspiring person you have ever met?", "How do you introduce yourself?", "What do we have in common?", "What is important today?", "You’re holding a basket for an afternoon in the park with me. What’s in it?", "What is your dream vacation?", "What is the ultimate dessert?", "What is God trying to teach you?", "What is your favorite time of year?", "What encourages you?", "What attracted you to me?", "What stresses you?", "What do you need prayer for?", "What is your favorite holiday? Why?", "What is your earliest childhood memory?", "What is your favorite joke?", "What are you concerned about?", "What does “courage” mean to you?", "Have you ever told a lie?", "Are you content?", "What are you waiting for?", "When do you feel lonely?", "What are you grateful for?", "What do you do that you feel good about?", "I hand you a box. What’s in it?", "What’s the grossest food that you just can’t get enough of?", "What situations often bring you to tears?", "Do you give money to homeless people/beggars? Why or why not?", "What are your child-support/custody arrangements with your ex?", "Who will pay for your wedding? Does that person then have control over wedding plans?", "If you were given five million dollars to open a small museum, what kind of museum would you create?", "Do you enjoy doing yard work? Do you expect your partner to help you with the yard work? Or for them to do it without you?", "What obstacles would be included in the World’s most amazing obstacle course?", "What’s something common from your childhood that will seem strange to future generations?", "What company do you despise?", "Do you ride motorcycles? Do you wear a helmet when bicycling or motorcycling? Is it the law where you live?", "Does it bother you if you partner leaves their hair in the sink?", "If your partner had a different last name than yours, whose last name should be given to the child?", "Do you enjoy hosting out of town guests in your home? If so, how long?", "Have you ever abused or molested a child (or been accused of it)? If so, what steps should we take to make sure it doesn't happen again?", "Do you feel like most people respect your line of work? Do you think you get the respect you deserve?", "When you are old, what do you think children will ask you to tell stories about?", "One thing I use every day that I could probably live without is...", "When you are married how many times a week do you think you would eat out?", "Have you ever performed on stage in a band, a play or other performance? How did it make you feel?", "On a typical month, how much is your long distance phone bill? Does that include international calls?", "What invention doesn’t get a lot of love, but has greatly improved the world?", "What do you tend to be humble about? When do you catch yourself being arrogant?", "Would you want your spouse to talk with you first before they dramatically changed their hairstyle or facial hair?", "In what ways does our relationship help and/or hinder the achievement of your goals?", "If your partner asked you to slow down or to drive more carefully, would you?", "Do you have any strong preferences on naming your children?", "Do your religious beliefs prohibit the celebration of certain holidays?", "What’s the most ironic thing you’ve seen happen?", "Do you believe that God does anything that does not make sense?", "Do you currently suffer from a sleeping disorder? Have you ever?", "In the past people were buried with the items they would need in the afterlife, what would you want buried with you so you could use it in the afterlife?", "What’s the funniest pick up line you’ve heard?", "What do you like/dislike about the town(s) where you grew up?", "How many months of expenses do you think we should have in savings to feel secure? If we don't already have that much, how should we build up our savings?", "What one thing could you change in your behavior that would make your relationship closer? What is keeping you from making that change?", "What fashion trend makes you cringe or laugh every time you see it?", "Do you have guidelines regarding movies you will not see?", "Did your family tend to share feelings and emotions when you were growing up?", "What’s the most recent show you’ve binge watched?", "How do you feel about the way your parents raised you? How did they do a good job and how did they mess up?", "Do you find it easy to start conversations with strangers?", "How do you feel about permanent tattoos? Why do you think most people get them?", "Are you a gourmet - enjoying trying all sorts of international cuisine or do you prefer to eat the same basic food all the time?", "What are your thoughts on handguns that serve no other real purpose than shooting people?", "How would you feel about your spouse opening your personal mail? Bills?", "How were you shown affection as a child? Do you think you will show your children affection the same way or differently? What do you think is the best way?", "From previous relationships, what was the best date you had? What was the best date we have been on?", "How many times during the year do you travel? How many times for business and how many pleasure vacations?", "Have you ever been hospitalized? What for? What was the experience like?", "Over the last five years how do you think you have changed for the worse? Better?", "Is there anything you would physically fight for?", "Do our incomes cover our expenses? Separately, and if pooled together? How much do each of us spend each month/year on the following categories: housing, clothing, food, entertainment, debt payment, and miscellaneous expenses. Should we cut back spending in any categories to achieve our goals?", "Are you listed as an organ donor on your driver's license for when you die? Would you like for your organs to be donated?", "If your job took you away from your partner and children for two months each year what would you do with your time? Do you think your marriage would be strengthened or weakened if this happened regularly?", "When was the last time you stayed up through the entire night?", "What’s the smartest thing you’ve seen an animal do?", "If I had to do it all over again, I probably wouldn’t...", "What would you want to teach your children about fist fighting?", "What are your thoughts about telling jokes at your partner's expense?", "Should marijuana be made legal? How would that change affect society 20 years from now? ", "If a woman doesn't feel maternal enough to want to stay home and raise her children, is it better that she make the choice not to have children?", "How comfortable are you speaking in front of large groups of people?", "The people I grew up with influenced me by...", "Do you have a desire for a lot of land with your home? How much?", "How do you make yourself sleep when you can’t seem to get to sleep?", "In order for you to trust someone, what do you need to see in him or her?", "Do you take your pets with you on short trips? Long vacations? Do you put them in a kennel or have a friend watch them?", "Do you consider yourself in shape?", "What’s the most pleasant sounding accent?", "One thing I know I do well (or better than most) is...", "How much time each day do you think you should spend with your children?", "Do you think your parents are/were racist? How did that affect the way you think about people of other races?", "What weird potato chip flavor that doesn’t exist would you like to try?", "What’s the most epic way you’ve seen someone quit or be fired?", "What one topic do you wish I would be able to talk about more openly and freely?", "How do you feel about your partner redecorating without consulting you?", "How many weeks each year can you take off from work?", "If you had a son, would you want him to be circumcised? Why? Have you read any literature on the pros/cons of circumcision?", "What’s the worst thing you’ve eaten out of politeness?", "In what ways are you smart?", "How do you feel about men and women killing people from other countries? Have you already been in a war? How did it affect you to have to kill (or support those who killed) others?", "Do you decorate elaborately for holidays? Would you like to put up more decorations if you had the time/money?", "What is your relationship with your siblings?", "What would be the best thing you could reasonably expect to find in a cave?", "Do you tend to analyze your decisions before you talk about them or do ideas and thoughts blurt out without much forethought?", "Describe your getting ready for work/getting ready for bed ritual.", "Are you more sensitive than most people of your gender?", "To what extent are you involved in politics?", "Do you eat food that’s past its expiration date if it still smells and looks fine?", "Are you allergic to animals? If your fiancé was allergic to your pets, would you be willing to give them away to a good home?", "If you were given one thousand acres of land that you didn’t need to pay taxes on but couldn’t sell, what would you do with it?", "How many hours of TV do you watch in an average day? When do you turn the television on and when do you turn it off?", "How important is it that a couple is friends first before they get into a love relationship? Do you think it is easy to build a friendship after a couple has already been lovers?", "How long is it wise to wait to tell someone you love him or her? Should you try to build a good friendship first?", "Do you have any special dietary needs? How do you need me to support you with this need?", "What’s something that everyone knows is true, but we don’t like to admit it?", "Do you think that if a person offends your partner they have offended you as well?", "What nicknames do you have for people in your life?", "What are some things that you consider a waste of time?", "Has anyone ever done something to you that you have never forgiven? What was it? Why haven't you been able to forgive?", "What crazy thing have you done in the name of \"love\"?", "What mythical creature do you wish actually existed?", "In what situations, do you wish you could throw down a smoke bomb and disappear?", "Do you believe that the Bible is the inspired Word of God? Why?", "How would you feel if one of your friends said he or she was gay? Would you still want to socialize with him or her?", "What was the most important appointment or deadline you missed?", "What sort of physical affection do you think is appropriate in public? Does it matter whether or not the couple is married?", "What’s your best story of you or someone else trying to be sneaky and failing miserably?", "If you are dating someone, at what stage do you think it is wise to bring up the idea of marriage? If you bring up the subject before both of you are really ready to take it to the next level, what potential problems could that cause?", "Is your business/line of work seasonal? What do you do during the slow periods?", "How do you feel about your boyfriend/girlfriend showing up at your house without warning?", "If I could go back in time, I would change _______ so that ______...", "Can you say \"no\" to your parents when they want you to do something you would prefer not to?", "If you have something that you really need to do, but you keep forgetting about it, how should I remind you without being a nag?", "Do you plan on rearing your children close to how you were reared, very differently or a mixture?", "What’s the weirdest crush you’ve had?", "What makes the difference between a good husband and a great husband? Good wife and a great wife?", "Do you think you are a romantic person? Could you convince a jury?", "What is your primary mode of transportation? Do you wish you had a different option?", "What songs hit you with a wave of nostalgia every time you hear them?", "What awful movie do you love?", "What’s the funniest actual name you’ve heard of someone having?", "Do you believe that most people are trustworthy and honest?", "What is your opinion on women spending money to get their nails done? Do you have a preference on how you like women's nails?", "What outfit could you put together from clothes you own to get the most laughs?", "What's your favorite ice cream flavor?", "What outfit of mine is your favorite? Why is it?", "When you ask your partner a question, does he or she always respond? How do you feel if you don't get a response?", "Do you sense that others may think that you talk too much about yourself?", "My favorite comfort food is...", "Do you ever diet? What sort of diets do you usually go on?", "What does the opposite sex do that you wish that you could do, but it’s not anatomically feasible or it’s socially frowned upon?", "If we currently attend the same church but years from now I lost interest and stopped attending, how do you think that might affect our marriage?", "Do you tend to be punctual or are you usually late?", "Do you ever drink and drive? Would you agree not to if your partner had a big problem with you doing so?", "If you went bald, would you consider wearing a toupee or getting hair plugs?", "At what age do you think you would be too old to have children to really enjoy them?", "How many minutes of undivided attention per day do you give your lover? Is that usually enough?", "What’s the most annoying thing about the social media platform you use most often?", "Do you think your partner is \"romantic\"? If not, how could he or she improve?", "Do you have a feeling that your partner would like to change any of your qualities or behaviors? Which ones?", "What’s your good luck charm?", "What is your favorite type of art? Do you feel you are artistic in any way?", "If you had to disappear and start a whole new life, what would you want your new life to look like?", "Tear gas makes people cry and laughing gas makes people giggle, what other kinds of gases do you wish existed?", "Do you personally wash and wax your car? How often?", "When, if ever, was the first time you smoked a cigarette? Why did you try it? How long did you smoke? If you still smoke, have you ever seriously tried to quit?", "Do you like a breeze blowing on you while you are asleep?", "What were you completely certain of until you found out you were wrong?", "If animals could talk, which animal would be the most annoying?", "Do you have any preferences regarding the honeymoon? (hot, cold, not Las Vegas, a surprise, not a surprise, etc.)?", "Instead of the job I have, I’ve always dreamed of being...", "Do you save up for a vacation or do you put it all on credit and pay it off as you can?", "How many people have you dated that you said \"I Love You\" to?", "Is there any way we could use religion to help fill our marriage with love and peace?", "What's the biggest fight you've had with your family? Has the issue been completely settled?", "How many hours a week do you usually spend taking care of your yard?", "What are some of the best vacations you’ve had?", "If you were moving to another country, but could only pack one carry-on sized bag, what would you pack?", "What’s your funniest story involving a car?", "If you suddenly became blind, how would your idea of the perfect partner change?", "Did one of your parents love you more than the other?", "When I was a teenager, I never told my parents that I...", "What is the maximum length vacation you think you could take away from work without causing a problem? If you were retired or between jobs how long could you be away?", "If you and your spouse worked, who would take care of any children you had?", "How would your country change if everyone, regardless of age, could vote?", "What life skills are rarely taught but extremely useful?", "Do you make your bed every day? Does it bother you if it is left unmade?", "Do you think that humans will ever be able to live together in harmony?", "People like to be shown love in different ways. What are some of the ways you like to be shown that someone loves you?", "How would you feel if I began to spend more time working on my hobbies and talents if it took time away from our relationship?", "How do feel about your partner reading your private email?", "What “old person” things do you do?", "What movie quotes do you use on a regular basis?", "How much do you feel we should spend on Christmas? Who should we buy gifts for: friends, all relatives, co-workers, mailman, etc? Or do we want to try to celebrate it spiritually without all the commercialism? If so, how do we celebrate it?", "What word do you always mispronounce?", "What is your favorite snack food? Dessert?", "Do you get a regular medical checkup? When was your last one?", "What was the best vacation you've ever taken?", "How do you feel that a husband can “submit” in marriage?", "What’s your secret talent?", "What inconsequential super power would you like to have?", "What’s your best story from a wedding?", "Should kidneys be able to be bought and sold?", "Have you ever hired a gardener? Do you think they are a waste of money or money well spent?", "What do you find attractive about my physical features? Is there a favorite?", "Men, what do you think is the best thing about being a guy? Women, what do you think is the best thing about being a female?", "Who do you think should be responsible for grocery shopping and cooking in a marriage?", "Do you belong to a culture that has certain expectations regarding weddings and receptions?", "Do you get irritated when you have to wait in long lines? Will you wait 45 minutes to be seated in a restaurant?", "What chore do you most detest?", "At what point would you consider yourself \"rich\"?", "Where do you get most of the decorations for your home?", "Are there any types of pets that you refuse to live with (snakes, rats, stray dogs, etc.)?", "How do typically handle the trauma from a big loss whether it is from the death of a loved one, getting fired or some other big disappointment?", "My dream home would be...", "Do you try to eat healthy meals? Organic?", "Do you usually date people who have similar physical characteristics? What are they?", "Have you ever been stalked by anyone? What did you do?", "What’s the most ridiculous thing you have bought?", "How often do you call in sick when you are not really ill?", "Do you enjoy debating others?", "What’s the most embarrassing story from your childhood?", "If you just found out that you and your partner were expecting a child, how would it make you feel? How do you think your relationship would change as a result?", "If you could talk to animals and they would understand you, but you couldn’t understand them, what would you do with that power?", "Is there anything that makes you feel homesick, nostalgic or sentimental?", "What word is a lot of fun to say?", "Have you ever hit someone in a previous relationship?", "What animal would be cutest if scaled down to the size of a cat?", "What is the minimum amount you think you could spend on a wedding and be happy with it?", "What country is the strangest?", "Have you seriously studied other faiths besides your own? If you are a Christian do you know what other denominations believe and teach?", "Do you have health insurance? If we were to get married, would it be better to combine the insurance under one employer?", "Do you collect anything? How long have you been collecting? Why do you collect?", "If you could make any three changes to our school systems, what would they be?", "How do you feel about going on weekend getaways?", "If you and your spouse had two cars, one much nicer than the other, who do you think should drive the newer vehicle? Would it make any difference if only one of you worked?", "Ideally, what are the minimum number of years you think you would need to build a solid relationship/marriage before you add children to the mix?", "What near future predictions do you have?", "Is there anyone you would be willing to die for?", "At what age or what level of financial stability (loans paid off, x dollars in savings) would you like to retire? How do you think you would spend your retirement?", "When you get married, do you think there would be any changes in your social circle? Which friendships do you think you would let go and which ones would you add?", "What’s incredibly cheap and you would pay way more for?", "What did you think was going to be amazing but turned out to be horrible?", "What product do you wish a company would make a “smart” version of?", "Is it difficult for you to say \"I love you\"?", "In which areas of your life do you feel like you are an independent?", "Do you think people who decide not to have children because they don't have a strong desire are selfish or wise?", "Do your partner's table manners embarrass you when you eat in public?", "What sort of reaction do you have when you get very upset?", "Do you have an idol? Do you try to model yourself after him or her in some way?", "Do you get emotional (irritated, sad, joyous, etc.) before or after any holidays? Which ones and why?", "If people receive a purple heart for bravery, what would other color hearts represent?", "Do you enjoy experiencing different ways of life or do you usually find it frustrating that they don't do things as efficiently or like the way things are done back home?", "Have you ever had an emotional breakdown or been diagnosed with a mental illness? How long did the recovery take?", "If you lived in a virtual reality world of your own creation, what would it look like?", "How often do you get sick? Is it a cold, flu or usually something else?", "If you say you are a religious person, do you really practice it? Have you studied your religion's doctrines? In which ways are you not actively following your faith?", "Do you get your pets \"fixed\" or do you allow them to keep producing litters? What do you do with the babies?", "How do you feel about your children participating in sports where the aim is to hurt one another or there is extreme physical contact such as boxing, football or rugby?", "What’s the most amazing true story you’ve heard?", "Have you ever committed a felony? Have you ever been arrested?", "Do you regularly give financial support to your adult children? Why? How would you feel if your spouse kept bailing your children out of trouble by giving them food, money or letting them live at home?", "If you wanted to become a one-income household after the birth of your child, what lifestyle changes would need to take place?", "How important is it to you that your partner is intelligent? More or less important than looks?", "Were you always getting in trouble for a particular thing when you were a child?", "How do you feel about women wearing makeup? What do you think is ideal?", "Have your grandparents taught you anything really important or profound?", "If you didn't like your partner's clothing or hairstyle, would you tell him or her? Would you want your partner to tell you?", "Are you more of an introvert or an extrovert? Does it change depending on the crowd?", "Do you fly as cheaply as possible or do you splurge for business or first class when going on vacation?", "What’s the most awkward thing that happens to you on a regular basis?", "If you had huge financial losses and had to liquidate all of your possessions including your car and home, what would that do to your self-esteem?", "What odd smell do you really enjoy?", "How many times a day do you brush your teeth?", "What is your favorite fast food restaurant? How often do you eat there?", "Do you cook or do you only eat prepackaged food? How often do you go out to eat?", "What normally delicious food gets ruined when you wrap it in a tortilla?", "Do you keep things that have no real use and will probably never been used again (old newspapers, magazines, broken appliances, etc.)? Would you be willing to throw out or let your partner help you go through your \"junk\" if the clutter began to affect your relationship?", "My most embarrassing moment was...", "Who do you go out of your way to be nice to?", "Are you an organized person?", "Which celebrity is the most likely to have a collection of canes that are just for show?", "Can you recall what made you fall in love with your sweetheart?", "Would you rather take a one-week $5000 vacation or would you rather go on three different one-week vacations that cost $1700 each?", "Do any of your friends have things that make you envious?", "My perfect day would start with _____ and end with _____...", "What five things have you done in your life that you are most proud of?", "What was the best thing that happened to you today?", "As a kid, I once did this really stupid thing, and it was...", "What would a world populated by clones of you be like?", "What do a lot of people have very strong opinions about, even though they know very little about it?", "Who in your life is the worst at using technology?", "What always cheers you up when you think about it?", "Do you like your last name? If you don't like it, would you consider changing it?", "When you were a child, did you get an allowance? How much was it? Did you have to do chores to earn it? Would you want the same system for your children?", "Is it ever appropriate for someone to express anger in a physical way? If so, when and how?", "What seemingly innocent question makes you think “It’s a trap!”?", "What’s your “Back in my day, we…”?", "What was ruined because it became popular?", "I know it’s crazy, but I love to eat...", "Have you ever given a speech? What was the last one about?", "When men and women are dating, who do you think should pay for the date? Whoever arranged the date? Whoever makes the most money? Always dutch? Some other arrangement?", "Is there anything that you feel like telling your mom or dad but you haven't? Do you think it would cause more damage to you if you said it? If not, why haven't you told him?", "Do you believe most people who convert to their mate’s religion do so out of keeping peace in the family or because they sincerely understand and believe the tenets of their partner's faith? Does it matter?", "How much should a husband participate in the care of a baby? (i.e. feeding, changing diapers, late-night responsibilities, etc)? Does it depend who is the more gifted caregiver?", "What’s the worst hairstyle you’ve ever had?", "What’s something commonly done that gets progressively weirder the more you think about it?", "Are you generally an optimist, pessimist or a realist?", "If you had a day to yourself with nothing that had to be done, how would you pamper yourself?", "If I could live anywhere in the world, it would be...", "Would you like it if your partner massaged you without expecting any sexual outcome? If you don't give your partner massages, why not?", "What are some clever examples of misdirection you’ve seen?", "Do you enjoy camping? What eating/sleeping arrangements are tolerable?", "What sort of emotions (rage, anger, sorrow, etc.) do you think are inappropriate for people to express publicly?", "What do you hate most and love most about your car?", "If you were given the opportunity to successfully run for president, would you do so? When you won, what three things would you most like to improve in your country?", "Do both you and your partner know where all the important papers are and how to pay the bills should something happen to one partner?", "Look in your wallet. How many credit cards do you have? Do you need that many?", "Are you able to fall asleep with the lights on? TV on? How do you feel about your partner using your toothbrush?", "Which of your vices or bad habits would be the hardest to give up?", "What job doesn’t exist now but will exist in the future?", "Do you like to plan your week's menu in advance or cook whatever you are in the mood for (or have ingredients for)?", "Do you believe in love at first sight? If so, what about the millions of cases when love at first site ended in disaster?", "Would you be able to marry someone who formerly was in a gay relationship or had a few homosexual experiences prior to dating you?", "If you and your partner decide to get a hot tub or a pool in the future, who would be responsible for cleaning it?", "What’s the most boring super hero you can come up with?", "What has someone borrowed but never given back?", "How much money do you have invested or saved (stocks, annuities, retirement funds)?", "Do you use foul language? Why do you do it? Does it bother you when you hear others cuss?", "What outdated slang do you use on a regular basis?", "Have you ever been in a committed relationship where your partner slept with someone else? Did it end the relationship?", "Do you think you are a fairly typical man/woman in the way you think, act and believe?", "Do you have a dream that repeats again and again? What is it?", "What character in a movie could have been great, but the actor they cast didn’t fit the role?", "Do you believe in God? What were you raised to believe about religion?", "How many hours does it take until you can't stand being alone anymore?", "Do you have any fears of deeply loving someone?", "Where are some unusual places you’ve been?", "Do you believe that the Satan of the Bible actually exists? If so, what is he doing? Why is he evil?", "When was the last time you slept more than nine hours?", "On average, how many hours do you work in a given week?", "If you had to pick a different city to live in with your sweetheart and proximity to family and friends didn't matter, which city would it be?", "Do you have problems letting friendships dissolve when you realize you have little in common? Do you feel obligated to keep close family ties with relatives you would not normally choose to socialize with? Is it ever appropriate to \"divorce\" yourself from certain family members?", "What’s your worst example of procrastination?", "What’s the biggest overreaction you’ve ever seen?", "Do you see yourself as worthy of love? Why or why not?", "In what areas do you think parents should sacrifice for their children and which areas should they not?", "Do you think you could learn some important things from a parenting class? Would you be willing to go?", "How do you feel about dogs that are bred to attack and have been known to kill children (Pit Bulls, Rotweillers, etc.)?", "On which topics do you feel qualified at giving advice?", "What are some things that your partner has done for you that really made you feel loved?", "If you are in a grouchy mood, should I leave you alone or do something else?", "Would it ever be OK or desirable that you or your spouse didn't work?", "What movie or book do you know the most quotes from?", "Could you ever be married to someone whose breath and clothes always reeked of tobacco?", "Tell me about the most emotional cry that you can recall.", "What has been blown way out of proportion?", "What’s the most interesting documentary you’ve ever watched?", "How often do you call your parents/family members?", "What’s your go to casino game?", "How do you tend to express love for your sweetheart? (Things you do, Things you say, Gifts you buy, etc.?)", "Do you find boyfriends/girlfriends easy to trust or do they have to earn your trust?", "How much does your typical one week vacation cost (not including air fare)? Do you think you take budget vacations, moderate or expensive trips?", "Are you interested in an offbeat wedding (at a nudist beach, underwater, on a roller coaster, etc.)?", "What did you most enjoy doing with your family when you were a kid?", "Do you think tobacco should be banned since it is an addictive drug? If that happened what affect would it have on people's lives 20 years from now?", "Does any particular season make you happier than others? If so, do you know why?", "How is the opposite sex an enigma to you?", "What type of social gatherings do you prefer - small groups or large parties?", "What’s the most addicted to a game you’ve ever been?", "An accomplishment I’m particularly proud of is...", "When was the most inappropriate time you busted out in laughter?", "Do you think you could function without a credit card? Have you ever tried?", "What feeling do you have the most difficulty controlling?", "Do you believe that mankind is created with free-will (the ability to make right or wrong decisions) or that everything in life is predestined (planned out for you)?", "Have you ever lived with someone you were dating? In what ways did it lead to your break up?", "If you were a very talented writer and were guaranteed to sell 100,000 copies of whatever book you wrote, what would it be about?", "Is your current job position where you thought you'd be five years ago?", "Where do you think you would be most comfortable living? City or country? Near the beach or closer to the mountains? Hot, warm or cold climate?", "Who is the most manipulative person you’ve ever met?", "What TV show character would it be the most fun to change places with for a week?", "What do you like most about my personality?", "The most embarrassing thing that happened to me at work was...", "What has been your most positive experience with your religion or other religions?", "How often do you pray? Why do you pray?", "Are you a balanced person? If so, how did you get to be balanced? If not, what steps do you need to take to be more balanced?", "Is there anything you feel you must accomplish before you die? What steps do you need to take to achieve these goals?", "What rules do you have that would result in eviction of your teenagers? How many warnings would you give them?", "Who has zero filter between their brain and mouth?", "Do you enjoy talking about yourself - your job, your vacations, your accomplishments, etc.?", "If you are turned off on religion is it because of bad experiences you have had with humans or is it because you are unhappy with God?", "Am I a nagger? How so? Does it irritate you?", "How did you choose your major in college?", "What do you think it means to receive Christ as your Savior and Lord or \"have you been saved\"?", "Do you have any particular health concerns (e.g. heart problems, high blood pressure, diabetes, asthma, etc.)?", "What do you perceive to be your physical flaws?", "What are three goals you have for this year?", "How do you feel about gambling? If your company sent you on a business trip to Las Vegas, what limit would you place on yourself for gambling each day?", "Do you usually put things back where they belong soon after you use them?", "If you were in charge renaming things so that their names would be more accurate, what names would you come up with?", "Right now, I’m reading about...", "Do you have a role model in your profession? What about them do you admire?", "How do you think I could enjoy life more?", "What do you need help with most often?", "What has been your most negative experience with your religion or other religions?", "Do you arrive at the airport ahead of time in case problems arise or do you try to get there at the last possible minute so you don’t have to wait?", "Which meals would you like to be able to eat together? Do you think we will be able to consistently do so?", "What is the most important thing you learned from your father? What are some other things he taught you?", "Who did you use to look up to, but they screwed up and you lost faith in them?", "What makes you feel important?", "Which celebrity or band has the worst fan base?", "Do you think you could live more than six hours away from your parents and/or siblings?", "What is keeping me from relaxing and enjoying our relationship to the fullest?", "Are there things that are easier to discuss with your friends than your partner?", "If you were single, what rules would you have about seeing people who were already involved with someone or who had just broken up? What about co-workers or other people you deal with on a daily basis? What experiences have led you to these rules?", "If your sweetheart had a bachelor or bachelorette party is there anything you would find inappropriate? Would you agree not to allow anything to occur at your party that your partner feels inappropriate?", "In what ways do you think your parents could select a better partner for you than you could?", "What sort of wedding do you envision having? For what reasons would you have a completely different type of wedding or even elope?", "How much debt do you think a couple should shoulder themselves with the first year or two of marriage given that financial problems early in a marriage is one of the leading causes of divorce?", "What was the biggest realization you had about yourself?", "Have your parents given you any warnings about dating? Do you trust their advice?", "What do you think about people who want to wait until they are married to have sex?", "After the birth of your child, how much time would you want to take off from work? Do you have strong feelings about the mom staying home with the children until a certain age?", "If someone tells you a juicy tidbit about a friend or coworker, do you have difficulty keeping it to yourself? Do you ever tell people they shouldn't gossip?", "What exactly do marriage vows mean to you? What are legitimate grounds for divorce, if any?", "What role does art play in your life?", "How are you and your partner exactly the same?", "Which family member are you closest to? Has it always been that way?", "If your employer saw everything you did at work, what grade would he or she give you? A B C D or F?", "When was the last time you felt you had a new lease on life?", "What’s the scariest non-horror movie?", "Do you need to hear \"I love you\" or similar words on a regular basis from your partner?", "What was the last song you sang along to?", "Do you think parents have the right to return (to the store) or give away gifts given to their young children that they feel are inappropriate or junk?", "What was the darkest movie you’ve ever seen?", "What unethical experiment would have the biggest positive impact on society as a whole?", "Do you like your first name? Have you ever wished you had a different name? What name would it be?", "Do you enjoy eating leftovers? Do you refuse to eat leftovers?", "Do you believe there is one right person for you out there in the world or that there can be many different potential mates that you could live blissfully with?", "What are some misconceptions about your hobby?", "In your present career, how much do you think you will be making in 5 years? 10 years?", "Do you feel that your partner wastes a lot of time? Does that bother you?", "What’s legal now, but probably won’t be in 25 years?", "What’s the best lesson you’ve learned from a work of fiction?", "If you don't go to church at all or very often, do you think that might change when you have children? Why wait until then?", "How often do you think your gut feeling is correct? When can you remember that it was incorrect?", "How would you like your partner to introduce you to others? (boyfriend/girlfriend, partner, sweetheart, etc.?)", "If you could choose to know everything about one topic, what area would you choose to be an expert?", "On average, how many alcoholic beverages do you have in a week? Is that all at once, on the weekend or spread about through the week?", "What do you think about when you hear the word “classy”?", "Which family members should we buy birthday or special holidays gifts for (parents, siblings, aunts/uncles, grandparents, cousins, etc.)?", "What big event do you think will happen soon that most people aren’t expecting?", "Do you ever lose your temper? How does it manifest itself?", "What’s the most interesting building you’ve ever seen or been in?", "How important is it that you spend the holidays with your spouse and young children?", "What bothered you most about your previous boyfriends/girlfriends?", "Do you allow your pets to be on the furniture?", "What things have I done that make you question whether or not I love you?", "If your child was born with a birth defect that required around the clock attention would you take care of the child yourself or let it live in a professional home for children with such disabilities?", "If you could have any pets you wanted and had the space and money to properly care for them, what pets would you want to have?", "Are you good at taking phone messages or passing along important calendar dates to your partner?", "What word do you always misspell?", "Do you tend to get sea sick or motion sick? What cures have you tried?", "How do you think I handle myself when I'm in a crisis situation?", "What animal or plant do you think should be renamed?", "In which areas are you dependent on others?", "If you were given $50,000 to throw a party for all of your friends, what sort of party would you put together?", "Would you mind if your children are sexually active at the same age that you were? If you felt you had sex too early what do you think would have helped you to wait?", "What’s the dumbest thing someone has argued with you about?", "If I could win a lifetime supply of one type of clothing, it would be...", "If you and your partner's income doubled, how would you like your lifestyle to change?", "Do you think you are good or bad at handling money? How could I help you improve or how could you help me improve?", "Who is your best friend? What about this person makes them so special?", "Do you have a fear of being alone? Rejected? Unloved?", "Do you think your partner mismanages their money? How much do you owe on all your credit cards? All other loans?", "Are there any parts of a couple's private life that should not be discussed with family or friends?", "What artist or band do you always recommend when someone asks for a music recommendation?", "Do you have a favorite bar or place of entertainment? How often do you go there?", "What’s the most creative use of emojis you’ve ever seen?", "If you had a HUD that showed three stats about any person you looked at, what three stats would you want it to show?", "What are your thoughts about couples renewing their vows?", "Is there anything in your past that you need to disclose that might have serious consequences on our relationship in the future? Is there any \"dirt\" reporters might dig up if you were running for President?", "Have you ever been in a relationship where you believe one person was 100% to blame for some of its problems?", "What’s the most annoying noise?", "What sport could you play the longest in a televised game, without anyone discovering you aren’t a professional athlete?", "Are there any rituals you do every day?", "What’s the funniest comedy skit you’ve seen?", "One thing I wish I’d learned before I left home is...", "What’s the best sandwich you’ve ever had?", "I volunteer at. or If I were to volunteer, it would be for...", "What is your typical reaction when someone criticizes you? About what things are you most selfish?", "Would you ever spend $100 on a bottle of wine? $300? Under what circumstances?", "After you have used a towel, where do you put it? How often do you feel that towels should be replaced with fresh ones? Would you want to share your partner's towel or have your own?", "What story you’ve heard has stayed with you and always disturbs you every time you think about it?", "Would you rather be mute, blind or deaf? Which of the three would be the worst?", "As a child, what did you think would be awesome about being an adult, but isn’t as awesome as you thought it would be?", "Do you have any rooms that are off limits for bringing in food?", "If I get to choose my next life, I want to be...", "If your partner asked you to shave or not to shave (face, underarms, legs, pubic area) would you do it? What is your preference for shaving those areas?", "How did you feel when a beloved pet of yours died?", "If you had problems with my personal hygiene, would you be able to tell me?", "Do you think you could go skinny dipping with your partner in private? How about with a group of people you knew?", "Do you have a child's heart sometimes? What sort of “childish” things do you think about doing?", "If I could make anything happen for someone, I would...", "Who do you think should go to parent/teacher conferences?", "Do you prefer to be the passenger or the driver? Are you a back seat driver?", "Do you attend the church you were brought up in? Would you consider attending a different church/denomination if your spouse desired?", "Have you ever felt that a promotion has been given to someone else when you were much more deserving? How did you handle it?", "If you were hired to show tourists what life is really like where you live, what would you show them / have them do?", "Did you ever run away from home? If so, why?", "Someone once said \"A women who does not feel loved needs jewelry, gold and dazzling gifts to be happy. A woman who truly feels loved finds those gifts to be superfluous (nice, but not necessary)\". Do you agree?", "If you were paid a salary to work for any one charity for an entire year, which charity would you choose?", "If you could switch two movie characters, what switch would lead to the most inappropriate movies?", "Do you feel like you need to dress sexy? Why or why not? Do you feel that people who dress sexy are sending the message that they are interested in sex?", "Do you think you are competitive? In what areas?", "In most circumstances how long do you think most couples should date (having good communication at least on a weekly basis) in order to really know each other well enough to get engaged? How long should an engagement period be?", "If you were given a PhD degree, but had no more knowledge of the subject of the degree besides what you have now, what degree would you want to be given to you?", "What is your parents' nationality? Were you raised in that culture or do you know much about it?", "One thing I’m very afraid of is...", "What are some of the most common misconceptions?", "Do you collect anything? What and how long have you collected? To what lengths do you go to add to your collection? How much do you spend each year on your collections?", "Do you think you are a good influence on your friends or do you think they need you to be a good influence on them? How are they a bad influence?", "How have you changed since high school? What would your high school pals think about you now?", "How can I help you with your struggles?", "What’s the most anxiety inducing thing you do on a regular basis?", "How do you usually feel when you are with me for an entire day? What makes you think you will be a great husband or wife? Do we have any unresolved disagreements between us?", "Do you think it is wise to lend significant amounts of money to boyfriends/girlfriends? Could it cloud the relationship?", "Does anyone give you an inferiority complex?", "As a general rule, do you always kiss on a first date? What signal do you think kissing is giving?", "Do you really like the way I dress? What changes could I make that would please you?", "Would you rather live modestly and retire modestly at 50 or would you rather live more extravagantly and retire modestly at 65?", "If I could get paid to blog about anything, I’d write about...", "How long do you usually take to get ready in the morning?", "What would the box with all your hopes and dreams inside look like?", "What brand are you most loyal to?", "Do you think of yourself more as a leader or a follower?", "Have you given any thought to how you would want to discipline your children during early childhood, adolescent years and the teen years? Be specific.", "When was a time you acted nonchalant but were going crazy inside?", "What did you eat so much of that now you hate it?", "When was the last time you yelled at someone?", "Where’s the line between soup and cereal?", "Are you often embarrassed about how most of your race behaves? Do you think your race is superior to all others/most?", "How often do you go clothes shopping?", "Do you let your friends drive your vehicle if they need one to run an errand? Would you let you partner drive it on a regular basis?", "If you had to take a paid sabbatical and couldn't work for an entire year, what would you most like to do?", "How clean do you keep your house?", "Are you a morning, a night person or somewhere in the middle?", "An epic feast is held in your honor, what’s on the table?", "When’s censorship warranted?", "What profession doesn’t get enough credit or respect?", "Do you feel that you need to be occasionally held or emotionally supported by someone who is strong? Why or why not?", "What are your three favorite board/card games?", "What would be the most unsettling thing to keep occasionally finding around your house?", "Who do you think will officiate at your wedding? Do you care?", "What movie universe would be the worst to live out your life in?", "What current trend do you hope will go on for a long time?", "What really needs to be modernized?", "Could you live the rest of your life with me exactly the way I am now? Or would I need to change some things for you to be able to commit a lifetime to me?", "Is it more important that you attend a church where you are comfortable or is it more important that you worship with your husband/children? What do you think of couples who each attend their own Christian church?", "If a teenager asked for your advice on the best way to find a partner that they could spend a lifetime of happiness with, what would you say?", "If you were given unlimited resources, how would you lure the worst of humanity into one stadium at the same time?", "What songs do you only know the chorus to?", "What’s some insider knowledge that only people in your line of work have?", "Have you ever been to or would you ever go to a nude beach? What is your opinion on nudism (people who enjoy being nude around others - not in a sexual way)?", "What do you think is the common link among all (or at least most) of your friends? (School, Work, Personality, Hobbies, etc.)", "If you had to be famous, what would you want to be famous for? Do you think fame would be a good thing or a bad thing for your relationship?", "Do you prefer receiving expensive gifts or ones that come from the heart?", "Currently, how much personal privacy do you desire? Would it bother you if your partner was in the bathroom while you were using the toilet or the shower?", "What goals do you have for your marriage?", "What two things are terrible when separate but great when you put them together?", "From your past relationships, do you think that most people learn from their mistakes or do they simply keep repeating them?", "Are you able to keep secrets? Is it hard for you?", "Do you currently believe that you are mature and experienced enough to be able to build and maintain a very successful marriage? When did you feel you were ready or when do you think you will be there?", "If you were married when you died, would you want your partner to feel completely free to marry again? How long do you think he or she should wait before dating again?", "How many times a day/week do you take a shower or bath? Do you bathe in the morning or night?", "If you were single and quite wealthy, how would you weed out the \"gold diggers\"?", "Do you think a room full of toys benefits or hinders children's physical and mental development?", "Does public speaking frighten you? Have you had much experience with it?", "If you were married and inherited $200,000, how would you decide what to do with the money? Would your spouse have any input? What would you want to do if your spouse inherited the money?", "Do you usually just buy what you need at the store, whatever is on sale, or whatever looks good?", "Do you generally make to do lists? Would you like it or be offended if your partner helped you make a to do list?", "If you could have an all-expenses paid trip to see any famous world monument, which monument would you choose?", "What did you like / dislike about where you grew up?", "What’s your best example of easy come, easy go?", "What form of exercise do you prefer?", "Have you ever worked really hard at something but it didn't pay off in the end?", "Do you think you are interesting or a bore?", "How do you feel about pets being in the bedroom or sleeping on your bed?", "What’s the cutest thing you can imagine? Something so cute it’s almost painful.", "If we ended up having opposite political views, how would that affect our relationship? Any particular issue you would find difficult to tolerate the opposite viewpoint?", "Have you ever lived alone? Do you or did you enjoy it?", "When you are sick and feeling poorly, do you like to be alone or do you like to be pampered and have someone close to your side most of the time?", "If I had to leave my native country, I would go to ______ because _____...", "How do you judge a person?", "Are you content with your current job? If not, why?", "What do you think is the best way for couples to handle disagreements?", "Can you live in a place that has junk in the yard (broken down vehicles, old appliances, ratty furniture, etc.)? Does your yard currently have junk in it? What are your plans for the junk? Would you do everyone a favor and haul it to the dump this week?", "If there are some things from my past that are just too painful or uncomfortable to share is that ok with you? Would you be able to commit to someone who can't share everything?", "Do you believe in tough love - letting children suffer consequences from their repeated mistakes?", "Would you let your teenager drink alcohol, smoke or do drugs? If not, how would you try to keep him or her from doing so?", "Have you ever thought you were in love and realized that you were only infatuated or you were quite deceived? How long did it take for you to realize it wasn't real love?", "What is the most thoughtful, caring thing you have ever done?", "When was the last time you were hopelessly lost?", "Have you ever written a love letter? Do you save old love letters?", "To what extend do you think God expects us to follow and obey religious leaders?", "What’s the funniest TV show you’ve ever seen?", "Do you think astrological birth signs represents ones character? Why?", "What would the adult version of an ice-cream truck sell and what song would it play?", "Do you think I am a lot like the other members of my family? How am I like them?", "What’s something that everyone, absolutely everyone, in the entire world can agree on?", "If you have religious convictions regarding sex before marriage, what boundaries should you set up so you live up to those convictions?", "Is there anything that you have practically no self-control over (ice cream, offers for a roll in the hay, a bargain shoe sale, a beanie baby for your collection, etc.)?", "Do you have a preference of the sort of food you would like your children to eat? (vegetarian, organic, no sugar, etc?) Would you be willing to change your eating habits to match what you think your children should be eating?", "Do you think that children born today will have better or worse lives than their parents?", "How would you feel if I had breast implants?", "Has anyone ever thrown an extra special birthday party for you? What made it so memorable?", "If you could airdrop anything you want, worth two million dollars or less, anywhere you want, what would you airdrop and where would you airdrop it?", "Do you have any religious, ethical or cultural reasons why you think people of different races should not marry?", "What rituals could be added to our relationship on a daily, weekly, monthly and yearly basis that would help us to remain close?", "What’s your haunted house story?", "Do you think life insurance is a wise \"investment\"?", "Do you think of yourself as mechanically inclined?", "One thing on my bucket list is...", "What was the last situation where some weird stuff went down and everyone acted like it was normal, and you weren’t sure if you were crazy or everyone around you was crazy?", "What are your sleeping habits (do you steal the covers, sprawl all over the bed, etc.)?", "How much per month do you think we should plan on spending on our home and its upkeep? If we begin to make significantly more money, would you like to move into a bigger/fancier home?", "What’s the funniest joke you know by heart?", "If you and your spouse have disagreements about child rearing, what methods do you use?", "How much time do you currently spend working? What hours do you work? Will that change when you are married and have a family to come home to?", "Are you jealous of any of the members of your family? Why?", "Do you have a \"special place\"? Why is it so meaningful to you?", "Early in the dating stage, how strongly do you consider your friends and family's opinion as to whether you should continue seeing someone?", "Do you go into Internet chat rooms? Are they general chat rooms or devoted to a certain topic?", "If the woman in the relationship earns more money than the man how does that make you feel?", "What’s the worst thing you ate from a fast food restaurant?", "What piece of “art” would you create if you had to pretend to be an artist and submit something to a gallery?", "Do you remember your first alcoholic drink? What were the circumstances?", "What animal would be the most terrifying if it could speak?", "Do you think parents should foot the bill for their children's college expenses or do you think children actually appreciate and learn more when they have to pay all or a significant part themselves?", "What’s about to get much better?", "What mistakes have you seen in other couples that you want to make sure doesn't happen in your marriage?", "If we have children, how often would you like the children to see their grandparents? Do you have any particular concern about the children spending too much time with any of their grandparents or relatives (that are racist, alcoholics, foul-mouthed, ill-tempered, etc.)?", "What’s the weirdest text or email you’ve gotten?", "What’s the longest rabbit hole you’ve been down?", "How do you feel about having guns in your home?", "What’s the most overrated product out on the market?", "If you pray, what do you give thanks for and what do you ask for?", "Who do you feel like you know even though you’ve never met them?", "What is your number one flaw? What steps are you taking to overcome it?", "Do you enjoy going to amusement parks? Do you like going on the thrill rides?", "What details does your partner take care of that you know little or nothing about?", "If you partner started breaking things or hitting walls because he or she lost their temper, what would you do? What if your partner hit or verbally abused you?", "If I went to a dance or nightclub without you, how would you feel? What is your definition of \"cheating\" on your partner?", "What’s the craziest video you’ve ever seen?", "There are many types of love. Can you name some and tell how they are different?", "Do you put toxic poisons on your yard (weed killer, etc.)? How do you feel about using those chemicals?", "How should decisions be made in the family? Does the husband have the final say or do you do things democratically?", "Do you keep pictures of your past lovers? Would it bother you if your spouse had photos of past lovers? What about old boyfriends/girlfriends they were not intimate with?", "Do you find that driving with your partner is pleasant or stressful?", "Do you work better alone or with a team? Why?", "Do you think you have dated/have seriously known enough people to know for certain when a great match comes along?", "Which celebrity do you think is the most down to earth?", "Who looks after your home when you are away on vacation?", "What’s quickly becoming obsolete?", "What is your dream car? Where would you have to be financially to justify the expense?", "How many books do you usually read in a year? What type of books do you read?", "What are some of the dumbest lyrics you’ve heard in a song?", "What actors or actresses play the same character in almost every movie or show they do?", "What do you think could be done to improve the media?", "If your partner had an affair, how would you react? Could you forgive him or her?", "What’s the coolest animal you’ve seen in the wild?", "What do you think is the secret behind couples that have been happily married for over 30 years?", "Where is the most uncomfortable place you have ever slept?", "Do you think there are any books or movies I should read or see? Why these?", "What was your most recent lie?", "Which do you think should have the final say in decisions - logic or emotions? Why?", "Do you enjoy hugging people? Do you like receiving hugs?", "Do you feel that your partner often takes ten minutes to tell you something when it could have been said in 30 seconds? Does that frustrate you?", "What’s the most annoying animal you’ve encountered?", "If a fire destroyed your home and all of your belongings, what would you do?", "My best friend is my best friend because...", "What would be the click-bait titles of some popular movies?", "Do you find that you eat when you are bored, stressed, or worried? Are there emotional times that make you want to eat?", "What from the present will withstand the test of time?", "What songs do you feel compelled to sing along with when you hear them, even if you don’t totally know all the words?", "What are you currently worried about?", "If your partner had great interest in some sport or activity that you had absolutely no liking or interest in, would you try to like it or would you simply encourage him or her to do it without you? If your partner didn't like your hobby would you cut back significantly so you could enjoy more things together?", "Are there any circumstances where you think it is a good idea to put animals \"to sleep\"?", "Have you ever been on a group tour? What do you think about them?", "What's your favorite restaurant for casual dining? Favorite special occasion restaurant?", "Are you a coupon collector? Do you sometimes get fanatical about saving money on groceries?", "Not many people know this about me, but when I was younger, I...", "Do you experience PMS? Is it mild or severe? How does your mood change and for how many days? How do you want to be treated during your period?", "Think of a brand, now what would an honest slogan for that brand be?", "At what age do you think you would want to let your children group date? Single date? Will you let them go \"steady\" when they are teenagers?", "Do you think you read too much or too little?", "How would you feel if your spouse raised their voice (shouted) at you?", "Where are you not welcome anymore?", "What inanimate object would be the most annoying if it played loud upbeat music while being used?", "Have you ever said anything to me that you wish you could take back?", "What app can you not believe someone hasn’t made yet?", "Do you think that you are able to calmly and wisely react in emergencies? What are some examples of emergencies you have had?", "Is there anything that you constantly worry about?", "How often do you think a bathroom needs to be cleaned? Have you ever cleaned a toilet?", "What meal would you eat most often if you could?", "Have you ever played any musical instruments? Which ones and do you still play them?", "Do you have spiritual yearnings? What questions to life are you trying to figure out?", "Are you an activist for any causes?", "Do you like to take vacations that are activity oriented (cycling trips, skiing trips, scuba trips, etc.)?", "Do you prefer to stay in touch with others by letter, email, or the phone?", "What memory of yours feels real but is most likely false?", "What are you interested in that most people aren’t?", "If you were a ghost and could possess people, what would you make them do?", "If your spouse wanted to quit work to go back to school, write novels, or do something else that wasn't making any money, how long would you support him or her?", "Do you vote regularly? Do you vote straight Republican, Democrat or other party? Or do you analyze each candidate and vote for who you think is most qualified regardless of party affiliation?", "What’s the worst movie trope?", "What things tend to make you angry? How do you usually react when you are angry?", "What do you need from a partner to feel completely fulfilled? Has that changed over the years?", "If you could hack into any one computer, which computer would you choose?", "What’s the most physically painful thing you’ve ever experienced?", "Do you wish your partner were more or less jealous of you?", "What would your perfect bar look like?", "Have you ever had to deal with conflict in you family? How did you do it?", "What current trend makes no sense to you?", "Do you have any concerns over vaccinations or flu shots for you or your children?", "What do you do to make the world a better place?", "What's the largest number of people you've dated at one time? Did it cause any problems?", "What’s are some of your Pavlovian responses?", "How do you feel about mixing business with family? Business with friends? Do you have any experiences with either scenario?", "If someone narrated your life, who would you want to be the narrator?", "If you had children, what role would you want the stepparent to play? If you were a stepparent, what role would you like to play?", "Would you be willing to go through a workshop or class that discussed the basic beliefs and doctrines of your partner’s church?", "Did you go to college? Where? What degree(s) did you get, if any? Do you think your education has paid off? How?", "If you married someone who had a lot of debt and bills, how would you feel about helping your partner pay them off?", "When you are in a serious relationship do you tend to ignore your friends? Have you ever had friends get married and suddenly lose contact with their single friends? Is that to be expected?", "What are reasons a couple should have children? What are reasons they should not?", "Did you grow up in an ethnic or culturally unique community? What role does it play in your life? Will you want to stay active in that community when you get married?", "How long do you think most people can \"be on their best behavior\" and hide their real selves during a courtship?", "Do you still maintain friendships with former boyfriends/girlfriends? If your partner were uncomfortable about any of those friendships, would you end them?", "Have you ever deliberately thrown up food or ate tiny amounts of food to lose weight?", "What are some red flags to watch out for in daily life?", "If you could know the truth behind every conspiracy, but you would instantly die if you hinted that you knew the truth, would you want to know?", "Which religions do you think are the most harmful and destructive?", "Do you believe you need to be married and have children to be \"whole\"?", "Do you think that aliens exist?", "Have you ever stolen anything? Why? Were you caught?", "My favorite type of art is because...", "Do you keep your car clean or do you allow it to pile up with trash first?", "Were you a good teenager or did you give your parents a lot of grief?", "When you go on a vacation with someone, do you like doing everything together, most things together or most things on your own and then getting back together for meals?", "Which type of home do you think would have the most benefit for our lifestyle? Apartment (no maintenance but not much privacy and not a long term investment)? House (regular yard work and maintenance but the most privacy)? Townhouse/condo (no yard or exterior maintenance but certain restrictions and not as much privacy)?", "If you would earn only 70% of your current wages, would you take a job that gave you 100% professional fulfillment?", "Do you feed your pets food off of your plate? How do you feel about that practice?", "How do you feel about friends, relatives or people in need living in your house for a year?", "What still makes you cringe when you think back on it?", "Do you enjoy flirting with others? Why? What signals do you think flirting gives to most people? If someone were flirting with you the way your partner flirts with others, what would you think were their intentions?", "What was cool when you were young but isn’t cool now?", "Do you think that parents should love and care more for their children than their mates? Do you think it is natural for parents to want to love their offspring more than the person they married?", "If you have children from another relationship, how do you negotiate with whom they spend the holidays?", "If your family hated the person you were dating and voiced strong opinion against you marrying him or her, would you get married anyway?", "Why do you think the Bible states that Christians should meet regularly with other believers and worship Him?", "What would you like to happen to your body (buried, cremated, donated to science, etc.) when you die? Do you have this stipulation in writing anywhere?", "Do you think you want any (more) children? How soon?", "Have you ever gotten a second job to help pay for your non essential purchases?", "Do you think I can usually read your body language? Where am I good at it and what do I usually get wrong?", "What’s your best example of fake it till you make it?", "Do you smoke (or chew tobacco)? How often? How long have you been doing so and have you ever tried to stop? What methods?", "How long was your longest relationship? Do you regret staying in it that long?", "Would you want your children to be home schooled? Why or why not?", "What qualities do all your friends have in common?", "If there was a book of commandments for the modern world, what would some of the rules be?", "Do you usually return phone calls and emails within a day?", "What’s fine in small numbers but terrifying in large numbers?", "Who is the most creative person you know?", "If magic was real, what spell would you try to learn first?", "What’s something that everyone agrees we should change, but somehow it never changes?", "If I thought we needed help keeping our finances under control and suggested a “debt counselor” would you go with me?", "Do you \"take your job home with you\"?", "What problems do you see with the \"my money, your money\" approach to finances in a marriage?", "What would be the worst thing to hear as you are going under anesthesia before heart surgery?", "Do you have a favorite \"fancy\" meal?", "Have you ever hired a cleaning service? Do you think they are a waste of money or money well spent?", "Do you ever pick up hitchhikers? Which type of people would you pick up?", "What animal would you most like to eat?", "What are your father's and mother's religious backgrounds?", "Besides traffic violations, have you ever knowingly broken a law? What did you do?", "What sort of research, if any, do you do before you travel somewhere?", "Have I ever behaved in such a way around someone that made you feel uncomfortable?", "If you had to be a different nationality, what country would you like to have been born in? Why?", "What food have you never eaten but would really like to try?", "If you and your partner have significantly different levels of education, do you feel that it is hard to have a conversation on a level that is interesting and stimulating to you?", "What’s the most depressing meal you’ve eaten?", "If I could keep any animal as a pet, I would choose...", "If you couldn’t be convicted of any one type of crime, what criminal charge would you like to be immune to?", "What is the worst thing that a former boyfriend/girlfriend has ever done to you?", "If you could take out three things before the blaze, what would they be (Assuming there is no one in the house at the time of the fire.)?", "If someone gave you one million dollars that you were required to give to some person or organization, who would you give it to?", "Do you believe in reincarnation?", "If you didn't receive any gifts for Christmas (or the major holiday you celebrate) how would you feel?", "Would it bother you if I maintained a friendly relationship with my ex, especially for sake of the kids? At what point would you become concerned?", "Have I told you about my crazy Uncle Joe?...", "Which of us has the best skills at paying the bills and keeping track of our expenses? Which of us has the best skills for investing our money?", "What do a lot of people hope will happen but is just not going to happen?", "Do you think partners should spend the same amount on each other for Christmas? What amount? What if one partner earns far more than the other and you keep separate accounts?", "If cartoon physics suddenly replaced real physics, what are some things you would want to try?", "What foods do you really dislike?", "At what age would you tell your children about sex if they started asking questions? If they weren’t asking questions? What would you tell them? Or do you prefer they learn about sex somewhere else?", "What one skill do you wish you had learned but haven't yet (Play the piano? Learn a foreign language? Fly a plane? Etc.)?", "If you owned a restaurant, what kind of food would it serve?", "What topic could you spend hours talking about?", "What’s the best / worst practical joke that you’ve played on someone or that was played on you?", "Which of your friends is most successful? Would you like to have the same level of success?", "When you really don't feel like talking to me, why is that?", "Which way should toilet paper hang, over or under?", "What sort of parties do you enjoy going to? Do you like to go for a short while or stay until most people have gone?", "What product or service is way more expensive than it needs to be?", "Do you think you have ever been \"used\" for money?", "Were you afraid of God as a child?", "What’s the most rage inducing game you’ve ever played?", "What’s the most amazing place in nature you’ve been?", "Have you given any thought to how you will take care of your mom and dad when they are older and need assistance?", "Which newspapers/newsmagazines do your read? How often? How often do you watch the news?", "What’s the best way you or someone you know has gotten out of a ticket / trouble with the law?", "Do you usually have to work on any of the major holidays?", "What sort of tipper are you? Always 15%? Or more or less depending on the service?", "When was the last time you immediately regretted something you said?", "What was the worst shopping experience you’ve ever had?", "What’s the best and worst thing about the country you are from?", "Are you more likely to take over the counter medicines, prescription medicines, homeopathic medicines, natural remedies or nothing at all when you are sick?", "What are your thoughts on separate vacations? If we had limited income and different travel priorities, do you think we should take vacations without each other every once in a while?", "What is your favorite holiday? Why is it so special to you?", "Do you think that dressing is something you do out of necessity or do you enjoy putting outfits together?", "What do you think about eating meals (with your family) in front of the television? Do you think family time and discussions around the dinner table are important?", "Have you ever gotten revenge on someone? What did they do? What did you do in return?", "What are your career goals 1, 5 and 20 years from now?", "Which do you think you would rather have: a gorgeous partner who wasn't very interested in sex or very good in bed or a very ordinary looking spouse that was awesome in the sack?", "Did you complete your taxes from this previous year? Who did them? Do you always file on time?", "What movie can you watch over and over without ever getting tired of?", "What are some things you have learned from me?", "What would be an accurate tag line for each month?", "What’s something that I don’t know?", "Would it bother you if I walked around the house naked?", "If you enjoy traveling, what places do you like to go to most often? Are there any places you have no desire to go to?", "What happens regularly that would horrify a person from 100 years ago?", "Which, if any, household chores would you expect your children to do? Beginning at what age?", "What things about me remind you of anyone from your past, either past sweethearts or good friends?", "How have your family been poor role models for relationships?", "Have you ever been in a relationship that you wish you never had?", "What sports do you watch on television? College, Pro or both?", "Have you ever suffered from depression (not just feeling blue, but a feeling of extreme sadness that leaves you nearly paralyzed)? If so, what brought these feelings on, how long did the depression last and what therapies worked for you?", "If you had a giraffe that you needed to hide, where would you hide it?", "If you knew with 100% certainty that having children would decrease your marital satisfaction by 30%, would you still want children?", "One very memorable summer, I...", "Who do you wish you could get back into contact with?", "Has there ever been a time when you felt like you were going to \"lose it\"?", "Is there anyone from your past that you still have strong feelings for? Are they still alive?", "Do you usually do some business while you are on vacation (answering email, checking voicemail, returning phone calls, etc.)? How much time each day? Is that pretty much necessary?", "Do you think it is a good idea and shows maturity to be able to casually date more than one person at a time? At what point do you feel it is necessary to date only one person exclusively?", "Why do you think adultery takes place among married couples? What do you think you can do to help prevent it in your marriage?", "How soon would you like to move out of our first (or current) home? Next year? Five years? After the kids move out? Never?", "Has anyone every pressured you to get married?", "Has anyone very dear to you died? How did you handle it?", "In what way are you and your partner \"opposites\"?", "Do you believe in ghosts, angels or extraterrestrial beings? Why?", "When you were a child, what did you want to be when you grew up?", "Have you ever filed for bankruptcy?", "What would be the worst food to be liquefied and drunk through a straw?", "What experiences usually make you filled with joy?", "Do you think you could kill a person if they were threatening the life of your loved ones?", "What’s something that will always be in fashion, no matter how much time passes?", "What’s something that all your friends agree on?", "Can you always apply human logic to analyze religion?", "What do you think are your optimum hours of sleep to be fully energized?", "What were you teased about when you were younger? How did that make you feel? Did you tease others?", "Are there any foods you don't eat for health or other reasons?", "Does your partner have any religious beliefs that you feel are plain wrong (not going to doctors, no birth control, animal sacrifices, not wearing make-up, etc.) and you will not go along with?", "Have you ever received a D.W.I./D.U.I.? How many and how long ago?", "What are your thoughts on crying?", "Who was your craziest / most interesting teacher", "What’s the most ridiculous animal on the planet?", "One of my favorite life hacks is...", "If we practice different religions, what problems might that cause with our wedding, the way we celebrate holidays, and how we will raise our children?", "Do you have a location in the movie theater where you prefer to sit?", "Do you drink coffee? If so, how many times a week and how many cups each day? Do you feel that you need a caffeine \"fix\" to get going for the day?", "How would you rate your maturity among your peers?", "Do you get a lot of satisfaction from your job - do you feel you are somehow making a difference?", "Does your partner usually interrupt your sentences? Do you find it irritating? Does your partner monopolize the conversation, making it hard to speak?", "Do you think our family has the right to know your financial affairs (whether you are rich or deep in debt)? What would you tell them if they asked how much money you and your spouse make or how much money you have in the bank?", "In what ways do you like to be romanced?", "Do the needs of your relationship eclipse your personal needs very often? When and how do you deal with it?", "Do you think God created rules and instructions (a religion) to help men keep close to him? Or do you think man just made up those rules?", "Have you ever had serious thoughts about committing suicide? What are your thoughts about those who kill themselves?", "What temperature do you like it in the house during the winter? Summer?", "If your partner had a one-night fling after drinking too much, how would you react? Could you forgive him or her?", "How important to you is a house that is clean and without clutter? Would you be willing to clean the house to your liking if your spouse doesn't clean it to your satisfaction?", "Who should be responsible for sending holiday cards and thank you notes from the family?", "How much of your current single life do you want to maintain after you are married?", "How do you feel about getting dogs professionally groomed?", "How do you feel about your partner showing up at your wedding drunk or with a hangover? How do you feel about him or her getting drunk at the wedding?", "Would you feel awkward if your partner invited former spouses or lovers to the wedding?", "Do you like it when friends feel comfortable enough to drop by unexpectedly?", "Are you currently on any medication? What for?", "How much do you plan / prepare for the future?", "How many drinks does it take until you are definitely \"feeling it.\" Do you cut yourself off after a certain number of drinks? Or when do you know you have had enough?", "What was the most amazing physical feat you’ve managed to pull off?", "What was the best job you ever had? Why was it?", "What do you envision our home (our realistic home - not our dream home) looking like? The architecture, the décor, the yard, etc?", "How long do you think you could stay with my parents before you became unhappy or resentful?", "What naps are the most satisfying?", "What’s the coldest you’ve ever been?", "Is religion important in your daily life? Why or why not?", "At this stage in your life do you think you would prefer having children or being child-free? Do you think your feeling might change?", "How much do you think a person should give to a church or charity? (maybe put in terms of percentage of income)", "Are you fearful of germs or food poisoning and tend to toss everything out of the refrigerator that is more than a week old?", "Do you have a favorite movie? Actor? Actress? Comedy? Drama?", "Do you think parents should provide cars for their teenagers if they are financially able? Would you allow your teenager to buy his or her own car if he or she had the funds?", "How strong do you think a couple's marriage should be and how financially stable should they be before they try to have children?", "Did you ever hang out with the wrong crowd in school? Did your parents know about it?", "What is the most amazing slow motion video you’ve seen?", "What weird food combinations do you really enjoy?", "Have you ever sued someone or been sued? What were the circumstances?", "If your great uncle left you $100,000 in his will with the stipulation that you had to invest it for 15 years before you could touch it, what would you do with the money? Be as specific as possible.", "Who is your least favorite relative? Do you try to avoid him or her? Do you have a favorite relative? What makes them so special? Is your family important to you? Why?", "If I asked you to cut back the time you spend with people or activities and spend more time with me would you do it?", "What do you think is the best relationship advice you've ever received? Did the person giving it have a great marriage?", "Do you enjoy cooking for company or do you feel inadequate?", "What’s the saddest scene in a movie or TV series?", "Do you think you tend to attract a certain type of person?", "What is a talent that you wish you possessed?", "How long could you spend with your partner until you needed a little break and some time alone?", "If a couple has been very unhappy for five years and has tried counseling with no success, do you think they should get a divorce even though no cheating or abuse has taken place?", "How often do you see your family? Do you think that's enough or too much?", "When was the last time you face palmed?", "What makes you roll your eyes every time you hear it?", "What was one of the most interesting concerts you’ve been to?", "If you could create the perfect job and get paid well for it, what would it be?", "How do we decide how to spend our money? Do we have free reign to spend whatever we want as long as it is \"my money\" or is there an amount ($100, $500, $5,000) at which we need to discuss before making a purchase?", "How much of your body would you cybernetically enhance if you could?", "Do you tend to buy luxury items or are you frugal with your money?", "If you are a Christian, how can you put the focus of the Christmas season on Jesus Christ?", "What social stigma does society need to get over?", "What is your favorite time of day?", "Do you regularly take vitamins? Do you think the foods you eat have enough naturally occurring vitamins in them?", "What do you do when you hear something fall in the middle of the night while you are in bed?", "A TV series I’ve watched all the way through more than once is...", "Would you steal a car for $200,000 if you would be certain that you would not be caught? What about for $1,000,000?", "Are you chirpy in the morning or are you a grouch?", "What values are most important to you?", "In your successful relationships, are the people a lot like you or are they more like opposites?", "How do you feel about your partner greeting friends (or strangers) with a kiss?", "Do you think your partner can listen to you and do something else (like watch TV or read the paper) at the same time? Can you?", "I can’t stand it when...", "Do you wear anything in your hair or on your face when you go to sleep? How about a retainer or orthodontic equipment?", "One thing I cannot live without is...", "Have you ever been in a committed relationship and you slept with someone else? Did you feel guilty?", "Do you believe all religions are worshipping God the way He wants us to?", "Are you camera shy? Why?", "Where is the best place you’ve been for taking walks?", "What do you think you are much better at than you actually are?", "What’s the weirdest thing you’ve found lying on the ground / side of the road?", "What questions would you like to ask a time traveler from 200 years in the future?", "What school sports and activities did you participate in up through college?", "Do you have any concerns about my health or unhealthy habits?", "What is the most important thing you learned from your mother? What are some other things she taught you?", "One struggle I’ve had that has made me who I am is...", "If you wanted to slowly drive a roommate insane using only notes, what kind of notes would you leave around the house?", "Have you ever made a loan to someone of a large sum of money? Would you do it again?", "Do you allow anyone to smoke in your house?", "What positive things have you learned from observing your parents' marriage", "Do you use your yard for any activities?", "What did you believe for way too long as a child?", "What to date has been your greatest source of learning?", "If you were married, how would you like to meet new people to socialize with?", "What tips or tricks have you picked up from your job / jobs?", "What’s your grossest bug story?", "Which charity or charitable cause is most deserving of money?", "Have you ever done any stupid or dangerous things when you were drunk? Like what?", "Can you think of anything that might make you want to stop attending church?", "How do you think you can help me to become a better person?", "What first attracted you to me? How has that one attraction changed since then?", "Do you clean up the kitchen after every meal? Each night? Or when you run out of dishes or company is coming over?", "Are you highly critical of the food and service when you dine out?", "What two films would you like to combine into one?", "If someone decided that they really don't see a happy long-term relationship with you, how would you want them to end it?", "Do you write important dates such as birthdays and anniversaries in your calendar? Do you use a calendar? Do you usually remember those dates?", "Do you have any customs or rituals regarding celebrating births and remembering deaths in your family?", "What’s the funniest word in the English language?", "Who would you prefer to never speak to again? What made them so undesirable?", "Can you think of any trait of mine that reminds you of your father or mother?", "Have you been abused in any way - sexually, emotionally, or physically? Do you still have emotional scars from it? Have you ever counseled about it?", "Do you think your family should have a limit on the hours of television watched each day? Would you be willing to start this week?", "Have you ever had a bad breakup? Why was it bad?", "Do you feel that the pluses outweigh the minuses regarding having a television in the bedroom? What are the positives and negatives?", "Do you currently have a will? If not, why?", "What is your definition of \"romance\"?", "How would you feel if your partner wanted to wear matching outfits or dress like you?", "How often do you feel the sheets should be changed?", "If someone wanted to give you a $50 gift certificate to use on yourself, which store/theatre/spa would you tell him or her you wanted?", "What are your most important rules when going on a date?", "Where’s your go to restaurant for amazing food?", "Why do you feel that you are trustworthy?", "What do you find most frustrating about men in general? What about women?", "What kinds of things do you like to cook or are good at cooking?", "If I could have any superpower, it would be...", "If you could plan any vacation for us, where would it be?", "Do you know most of your neighbors? Do you ever socialize with any of them?", "How often do you balance your checkbook?", "Do you think it is important that your children be breast-fed for both health reasons and for bonding? If so, how long do you think your babies should be breast-fed (most babies are breast-fed anywhere from 6 months - 3 years)?", "What’s better broken than whole?", "What are your favorite hobbies? Would you like to spend more time on them?", "Do you feel like you waste a lot of time? Do you wish you didn't?", "Do you prefer a low maintenance yard or a style that demands a bit of work? What style do you like (lots of lawn, lots of flowers, tropical, desert, large vegetable garden, etc.)", "What makes life worth living?", "How many hours a day on average do you spend on the computer/Internet (not counting time spent for work)?", "How do you feel when someone close to you disagrees with you?", "What is your favorite ethnic cuisine?", "What was the last photo you took?", "If I get offended or irritated at something you say or do, what is the best way for me to bring it up so that you don't get angry?", "Something I’d love to get rich by doing full-time is...", "I’d most like to be remembered for...", "When you travel, what is your usual goal (relax, sight see, see friends/family, do culture things, eat at new restaurants, etc.)?", "How many physical fights have you been in? Do you usually start them? Why do you fight?", "What scientific discovery would change the course of humanity overnight if it was discovered?", "What’s the opposite of a koala?", "If I had to eat one type of food for the rest of my life, it would be...", "Are you currently satisfied with the quality and quantity of friends you have? Why or why not?", "What areas do you think we could most improve our communication?", "Do you have a favorite type (or a couple) of music? A favorite singer? Or musical group?", "What’s the weirdest conversation you’ve eavesdropped on?", "When was the last time you called your Mom, just to tell her you love her? Your Dad?", "What elements of pop culture will be forever tied in your mind to your childhood?", "What family traditions did you have growing up? Would you want your children to continue them?", "How do you usually spend the \"big\" holidays? Do you do so mainly out of tradition or because you really enjoy celebrating it that way?", "How would someone be able to tell if you're happy? If you're sad?", "I look up to...", "Why would you like to be married some day?", "When taking off your clothes, do you immediately put them in the hamper if dirty, hang them up or fold them if clean or leave them on the floor?", "What are your top ten goals for your lifetime?", "Do you regularly go to musicals, operas or plays? If not, why?", "Are you currently comfortable with your body? If not, what would you change to make you comfortable?", "Should we try to move to an area that has a really good school system for our children?", "What’s the worst backhanded compliment you could give someone?", "Do you expect that both you and your partner would go to bed that the same time each night? How would you feel if your partner wanted to stay up several hours after you went to bed? What time do you usually go to bed on a work night? Non-work night?", "Do you think we should spend certain holidays with certain families or would you like to spend holidays alone (and with any kids we might have) for a change?", "How many hours a week do you typically devote to your religious practices (e.g. going to church, prayer meetings, bible study, etc.)?", "What problem are you currently grappling with?", "Do you fear looking older?", "What sort of limitations do you think you would want to place on your children regarding, television, music, magazines, Internet, etc.?", "Are you one who adapts to change easily? Can you cite some examples?", "If your job gave you a surprise three day paid break to rest and recuperate, what would you do with those three days?", "Are you currently involved in any criminal activities right now?", "About how many times a month/year do you attend church services?", "If you could be any height and build you desire, what would it be?", "Do you snore? Can someone hear you snoring from another room?", "What’s the silliest thing you’ve seen someone get upset about?", "Do you think you are ever obsessed with money? Is making/spending money one of the most important things to you? Do you think about money every day?", "Do stylish clothes, nice hair, expensive jewelry or \"things\" make you feel better about yourself?", "What trend are you tired of?", "What’s the funniest thing you’ve seen a kid do?", "What doctrines are essential for a church to teach in order for you to be able to become a member?", "If I won the lottery, the first thing I’d buy would be...", "What’s your best example of correlation not equaling causation?", "What sort of plans have you made for retirement?", "How often do you cry?", "Would you want the ability to hear the thoughts of people near you if you couldn’t turn the ability off?", "Do you remember what your favorite childhood books were?", "What’s the hardest you’ve ever worked?", "Do you have any superstitions? What are they?", "What game have you spent the most hours playing?", "What’s the oldest thing you own?", "Do you want a church wedding. If so, why?", "What’s something people don’t worry about but really should?", "If I had to be trapped in a movie or a video game for a day, it would be...", "What changes do you think I would need to make to better enjoy my career?", "What are the top five qualities that you hope your children will have?", "Do you always like to sample your partner's food in restaurants? Does it bother you if someone always wants to taste your food/drink?", "What habit do you have now that you wish you started much earlier?", "How does your faith help you cope with problems and trials? Are there evil spirits in the world? Do you fear them? What place do you believe religion will have in our lives?", "What horror story do you have from a job you’ve had?", "What’s a common experience for many people that you’ve never experienced?", "If your parents were to give you $30,000 to spend on a wedding, would you be willing to spend only $5,000 on the wedding and put $25,000 down on a house if that was acceptable to your parents?", "What was the most unsettling film you’ve seen?", "Do you get stressed out when finances are really tight?", "Have you ever traveled out of the country? Do you have a passport? When does it expire?", "What’s the funniest thing you’ve done or had happen while your mind was wandering?", "What’s the clumsiest thing you’ve done?", "What are your feelings about recreational drugs? Have you ever taken any and if so, how long did you use drugs? Do you still use them?", "How much time per day/week do you currently exercise? How much time do you think you should spend? How do you think we could help each other with our exercise regimens?", "What rules or standards do you set for dating? (i.e. No holding hands until you are in love, No kissing until we are talking marriage, No sex until marriage, No dating outside my religion, etc.) Have you ever broken your rules?", "How do you think a married couple should celebrate their wedding anniversary? Does it always have to be the same way?", "Do you think you would ever have interest in running for a political office?", "How important is religion when deciding to seriously date someone? What religious differences would cause you serious doubts about a long-term relationship?", "From your previous experiences, when you had a fight or argument with your partner, did you first run to family or friends for advice or comfort or did first try to work things out with your partner?", "What decisions have you made regarding how you plan to balance work and play?", "What do/did you most enjoy about being single?", "What actors or actresses can’t play a different character because they played their most famous character too well?", "What are the things that cause the most arguments in your relationships?", "What do you feel is important in a vehicle for you (seats 5, reliable, good gas mileage, built like a tank, looks good, fast, etc.)?", "What food do you crave most often?", "How often do you feel that you really don't know your partner? Will time fill in the gaps or do you feel that your partner won't open up and you may never really know him or her?", "What's your favorite alcoholic beverage?", "What does my family do that annoys you?", "What’s the most beautiful beach you’ve been to?", "What’s the spiciest thing you’ve ever eaten?", "If I could download a how-to book directly into my brain, it would be for...", "Have you ever dated someone just because they had (or you thought they had) money?", "How many movies do you usually watch in a month?", "If you are a Christian, what does the word \"submission\" in Ephesians 5:21,22 mean?", "How much do you think a spouse should inform his or her partner regarding their schedule and whereabouts?", "Do you think you would enjoy going on a vacation with your sweetheart's family? Would you detest it or do you not know them well enough to decide?", "Were you taught proper table manners growing up?", "Do you have a position on the government killing men and women who have knowingly committed murder?", "Do you feel strongly against people wearing fur coats? Are you liberal, conservative or somewhere in the middle?", "Do you have money invested in the stock market? Do you check your stocks every day? How often do you make trades?", "Do you find it difficult to compromise on things?", "Second hand smoke is one of the leading causes of cancer and breathing related illnesses. Will you allow anyone to smoke around your children? If you smoke now would you make a serious attempt to quit before having children?", "What escalated very quickly?", "What do you think you do better than 90% of people?", "Do you live to eat or eat to live?", "What goal do you think humanity is not focused enough on achieving?", "Do you believe that there are some laws that aren't necessary to be kept?", "Does your religion have a policy on contraception? What is it?", "Did you have a point in your life where you turned your life around?", "What’s your favorite holiday movie?", "Prior to this year, what is the best gift you've ever received? Why was it so special?", "What makes you feel secure and safe?", "What are your thoughts on adopting children if you were unable to have children of our own? Would you adopt even if you could have children? Would you prefer surrogate motherhood or fatherhood to adoption?", "What’s the creepiest tech out there?", "Do you think someone should ever correct his or her partner in public?", "The last time I made a fool of myself, I learned...", "Have you ever considered marrying someone because you were fearful that no one else would come along and you would rather be married than single and lonely?", "If I were really bothered about you sharing our fights/disagreements with your friends and family would you agree not to do it? Or would you agree to discuss it with them only if we couldn’t solve the problem on our own within a couple of days?", "What makes the difference between a good parent and a great parent?", "Which protagonist from a book or movie would make the worst roommate?", "Which apocalyptic dystopia do you think is most likely?", "What one thing could we do to improve our dates together?", "If you and your partner had significantly different religious beliefs, what would you teach your children about God? Would you want your partner to teach your children things that contradict your beliefs?", "How do you handle the language barrier when you travel to foreign countries? Are you willing to visit places where your language might not be spoken?", "Do you ever think that your partner gives more time, love and affection to a child or pet and it makes you jealous?", "In what circumstances do you feel most at peace?", "If the doctors detected that your unborn child had a severe birth defect and they could easily abort it, would you still have the baby?", "Do you enjoy shopping, don't care one way or the other, or detest shopping? Does it change whether it is for clothes, electronics or food?", "Could you marry someone who does not share your fundamental religious beliefs?", "Do you like to exaggerate things for effect?", "Tell me about the biggest lie you've ever told? Why did you tell it and how did you feel afterwards?", "How could I make your life easier or more comfortable? What is your opinion on how I manage problems in our relationship?", "Do you enjoy going on long road trips as the driver? As the passenger?", "What’s the most expensive thing you’ve broken?", "How much do you spend on wedding gifts? Birthday presents? Christmas gifts?", "Before I started my career, would you believe I was a...", "What’s your cure for hiccups?", "What is the bare minimum you expect in a home?", "What shows on television do you always watch?", "Overall, how satisfied are you with your boss? Do you always seem to have \"bad\" bosses?", "How important do you think college degrees are in getting a good job? Does the college experience help you to be a successful person in more ways than just the book knowledge?", "Would it be okay for your partner to call you at work? Visit you?", "What happens in your country regularly that people in most countries would find strange or bizarre?", "What is your greatest disappointment?", "If your spouse was having serious doubts about themselves or the marriage and wanted to be separated for six months to think things over, would you agree and personally live as though you still married or would that signal to you that you are free to date again?", "The Bible emphatically states that eternal life only comes through belief in Jesus Christ and his sacrifice. If you are a Christian, how do you feel about living with someone who does not have the same hope of eternal life? What if they worshipped some other god than Jesus Christ?", "What movie, picture, or video always makes you laugh no matter how often you watch it?", "What animal is the most majestic?", "When was the last time you were snooping, and found something you wish you hadn’t?", "What’s the weirdest thing about modern life that people just accept as normal?", "What's your favorite candy bar?", "If money and practicality weren’t a problem, what would be the most interesting way to get around town?", "Who in your life has the best / worst luck?", "Do you think we should keep our money in joint or individual accounts? Why?", "I would love to meet (and even have lunch with)...", "Do you prefer to spend most weekends lazing around the house, getting out of the house or being productive?", "Do you wear your seat belt when you are in a vehicle? If not, would you wear one if your partner asked you to because they love you?", "What, if anything, do you feel you need to sacrifice or compromise in our relationship to make it happy?", "How do you know when you're in love and not simply infatuated? What did your previous partners complain most about you?", "Have I ever done anything or do I do things now that cause you to mistrust me?", "Do you like things to be carefully planned or do you prefer to just go with the flow?", "What’s the craziest conversation you’ve overheard?", "Can you have good conversations with someone you were just introduced to?", "What's the most romantic thing that's ever been done for you? What's the most romantic thing you've ever done?", "Do you fear God? Why or why not?", "How powerful is peer pressure to you? Do you feel you need to live in a similar fashion as your friends? Did you have problems with peer pressure in your earlier years?", "Are there duties or chores that you don't think you would do in a marriage? (take out the trash, mow the lawn, clean bathrooms, iron, etc)", "Do you go back to the same places again and again or do you desire to go to new places most of the time when you travel?", "If your aunt left you a large sum of money in her will for you to have any sort of plastic surgery you desired would you have anything done?", "What smartphone feature would you actually be excited for a company to implement?", "What’s your “and then it got worse” story?", "Where do you get your news?", "What’s wrong but sounds right?", "If you built a themed hotel, what would the theme be and what would the rooms look like?", "Do you think that luck has much to play in your life?", "If you got into financial difficulties, what would you try to do to get out of it?", "Do you have any phobias, fears or concerns about going to the doctor?", "On weekends how late do you like to stay out? On work nights? Do you like any activities that are daring or risky?", "In all the couples you have witnessed over the years, which one seems to be most blissful? What about their relationship would you like to be able to have?", "How many children do you think you would like to have?", "In what ways do you feel really blessed?", "On a typical day/night out with your friends, what do you do?", "What’s something that people think makes them look cool, but actually has the opposite effect?", "What would be some of the downsides of certain superpowers?", "If you were single, how do you think your life would be different? Have you ever been engaged? What happened?", "What fictional characters have you had a crush on over the years?", "How ambitious are you?", "Have you ever saved for a major expense or purchase or have you always put it on credit?", "How much do you think names affect the outcomes of people’s lives?", "One of my favorite things to do is...", "Do you think it is healthy for couples to fight (hurting each other emotionally or physically)? What steps could we take to express our disagreements maturely so we can have a \"fight-free\" relationship?", "What do you think about pornography? Do you think it is ever helpful?", "Do you have the self-control to only spend each month what you can pay off? Or do you always carry balances on your credit cards?", "Do you tend to keep a lot of thoughts and feelings to yourself or do you share them pretty openly?", "When did something start out badly for you but in the end, it was great?", "Do you have any allergies?", "How would you want to decide on what gifts to purchase for your children?", "What bit of trivia do you know that is very interesting but also very useless?", "Do you believe children should be seen and not heard? Why or why not?", "What do you put on your credit cards?", "Do you think you could ever give up your current life and move half way around the world for someone you love or for a perfect job?", "If you knew you would die in two days, how would you spend the time until then?", "What’s the shadiest thing you’ve seen someone do?", "If you found a wallet with $300 cash in it, would you return it to its owner? Would you turn it into the police if there was no identification in it?", "In your current relationship do you feel that it is often more work than fun? Do you think that is a sign something might be wrong or do you think that is how all relationships are?", "Do you think that it is important that the father is present at the birth of his child if at all possible?", "Do you have problems letting someone else control the remote control? Are you a channel surfer?", "If someone wanted to finance the startup of your business with no strings attached, what business would you start?", "What feeling do you have the most difficulty expressing?", "Do you often feel that your partner doesn't respect your hard earned income by the way they spend it?", "Do you feel that your lover is too needy at times?", "If you could live one year of your life all over again without changing a thing, what year would you choose? Why?", "What’s the most disgusting sounding word in the English language?", "How often do you go to concerts? What kinds? Would you go more often if you had more time/money?", "Who should plan wedding anniversaries? Would you like to rotate? Should we have a yearly budget?", "Do you like to throw holiday parties or dinners? What do you usually do?", "How would you feel if you only had boys or girls? Do you strongly want a particular gender?", "Will you eat everything on your plate no matter how much is there (assuming you like the food)? Or will you quit when you feel full enough? Do you need to feel \"stuffed\" to be satisfied?", "What’s the silliest thing you’ve convinced someone of?", "What small change greatly improves a person’s appearance?", "Do you screen phone calls before answering the phone? Can you let the phone ring during meals or when company is over or do you feel compelled to always answer it?", "What just around the corner tech are you eager to get your hands on?", "Do you think you would prefer a calm, loving, consistent marriage or one that was full of excitement, wild times and rocky patches?", "Have you ever gone to your boss and asked for a raise? Did you threaten to quit if you didn't get it? Did you get it?", "When we die, what do you think happens to us? What do you base your opinion on?", "Do you think that constantly buying your children new toys teaches them to become easily bored with things?", "If I could have the world’s best collection of something, it would be...", "If you could change one thing about your body, what would it be?", "What do you do with your junk mail?", "If you get a pet for your children and they don't take care of it, who will be responsible for cleaning up after it, feeding it and walking it?", "Do you currently hitchhike from time to time? Have you ever?", "Have you read any books on parenting? Do you think it is a good idea to read these books by \"experts\" or just go by instinct or the advice of family and friends?", "Have you tended to date people older or younger than you? Why?", "Do you believe that if you give money to churches or charity that you will be financially rewarded? Rewarded in other ways?", "Have you ever personally received Christ as your Savior and Lord? Yes/No/Unsure If yes, Where? When?", "What do you do to protect the environment? Do you think you should do more?", "Would you make a serious attempt to lose weight if your partner asked you to?", "Some people say they are \"spiritual\" but not \"religious\". What does that mean to you?", "Do you usually listen to music around the house? What kind? How loud?", "Do you think that it is cruel to keep a dog in a cage or tied up most of the time?", "What do you think about drinking in front of children? What about getting drunk?", "What food is delicious but a pain to eat?", "What if anything would you put before your spouse?", "How did you celebrate birthdays as a child? How do you like to celebrate yours now?", "When was the last time you got to tell someone “I told you so.”?", "Do you support (with money and/or time) any charities or causes?", "If you could build a vacation home anywhere in the world, where would you build it?", "What did you Google last?", "Do you have a real desire to (or feel that you really need to) get more education? What do you want to study? When do you want to start?", "What riddles do you know?", "What languages do you wish you could speak?", "Did you ever hear or see your parents fighting when you were a child? How did it make you feel?", "What’s the most historic thing that has happened in your lifetime?", "Should your sweetheart love you just the way you are, or would you be willing to make some changes (the way you dress, shaving, new hairstyle, etc) to become more attractive to him or her?", "What’s the most comfortable bed or chair you’ve ever been in?", "What do you think are my talents? Do you think you have any of the same talents?", "Do you like to travel on the spur of the moment (hey, let's drive to the mountains next weekend)?", "Have you ever dated someone who worked in your company? Did the company have a policy against that?", "What are you most fearful of? How does that fear keep you from doing things you would like to do?", "Can you go out and enjoy a meal or do you always have to \"rate\" it?", "Do you like to be the life of the party or do you prefer intimate, one on one conversation?", "When I was growing up, my parents made me...", "How to do feel about those who are in different religions? Do you believe that God has a plan to save the whole world from eternal death (those who want to be saved) or only those who hear and believe the \"truth\" in this lifetime?", "What are the pros for eloping? What are the cons? Does it sound appealing to you?", "What’s the most frustrating product you own?", "Do you consider it cheating if your partner is sharing sexual thoughts and fantasies online with others? What if they are engaged in cyber sex?", "What physical or personality trait do you think makes people first attracted to you?", "If you and your partner each have an income and maintain separate accounts, how do you split the costs of a vacation?", "Do you usually ask for help or support or do you prefer to fail all on your own?", "What does my body language tell you sometimes even though I'm not talking?", "Do you think you and your partner spend enough quality time together?", "Do you like to have chores scheduled or just do them when they need it (or you feel like it)?", "Do you have a preference for cats or dogs? Indoor pets vs. outdoor pets?", "What do/did you dislike the most about being single?", "Do you think our relationship would improve if we didn't watch television?", "Do you think it is risky or unhealthy for your partner to have a best friend's of the opposite sex?", "How personally involved do you get with \"your\" team's performance? If they lose, does it make you angry or put you in a bad mood?", "Ideally, what characteristics would your friends have? What have your friends taught you?", "Do you feel that your table manners need improving? Would you like for your partner to point out where you could improve?", "Do you think you are a harder worker than most people at your job? Are you happy with doing an average job?", "What’s something you really resent paying for?", "What in your opinion are the three best things about your lover?", "If you were a clown themed super hero, what powers would you have?", "If you and your partner purchased a pet and later split up, how do you think you would decide who got the pet?", "Do you think your partner talks too much on the phone and neglects you or other important things?", "Do you have pests (mice, roaches, spiders, etc.) at your house? Would you use an exterminator if your partner asked you to?", "What’s the most boring sport, and what would you do to make it more exciting?", "Do you have a favorite and least favorite day of the week? Why do you feel that way?", "In a past relationship, did you ever play games? How so?", "How many of your friends and family would you want to invite (and expect to show up) to your wedding?", "If your dear friends wanted you to donate sperm or eggs because they were infertile, would you do so? How would you feel about your partner doing so? What about donating them for a couple that would remain anonymous?", "Would you describe yourself as a peace-keeper or a trouble-maker?", "What outdoor activity haven’t you tried, but would like to?", "If you were single and wanted to write a personal ad describing your qualities, how would it read?", "What’s the weirdest thing that has happened to you while working at your job?", "Name one or two minor changes I could make to my appearance that would make me more attractive?", "After you are married, how much do you expect to spend on clothes each month?", "Would you rather Have telepathy or Have telekinesis", "Would you rather Be hot all the time or Be Cold all the time", "Would you rather Control space or Control time", "Would you rather Not be able to stop dancing or Not be able to stop singing", "Would you rather Not be able to read or Not be able to speak", "Would you rather Be able to command water or Be able to command the wind", "Would you rather Be an amazing dancer or Be an amazing singer", "Would you rather Be an amazing dancer or Be great at math", "Would you rather Live in a place where it is always hot or Live in a place that is always cold", "Would you rather Be poor with lots of good friends or Be rich with no friends", "Would you rather Know everything or Be amazing at any activity you tried", "Would you rather Wear clown shoes every day or Wear a clown wig every day", "Would you rather Be able to run incredibly fast or Jump incredibly high", "Would you rather Live a short life and be rich or Have a long life and be poor", "Would you rather Only be able to jump everywhere you go or Only be able to walk on your hands", "Would you rather Never be able to eat warm food or Never be able to eat cold food", "Would you rather Have a two-bedroom apartment in a big city of your choosing or Have a mansion in the country side in the state or country where you currently live", "Would you rather Have a very muscular lower body and a normal upper body or Have a muscular upper body but a very skinny lower body", "Would you rather Have a song of your choice play repeatedly 24 hours a day for a year or Have songs that you have no control over play 24 hours a day for a year", "Would you rather Be completely alone for 5 years or Constantly be surrounded by people and never be alone for 5 years", "Would you rather Eat your favorite meal for every meal for the rest of your life or Never be able to eat your favorite meal again", "Would you rather The aliens that make first contact be robotic or The aliens that make first contact be organic", "Would you rather Lose the ability to read or Lose the ability to speak", "Would you rather Be covered in fur or Be covered in scales", "Would you rather Be in jail for a year or Lose a year off your life", "Would you rather Always be 10 minutes late or Always be 20 minutes early", "Would you rather Have one real get out of jail free card or Have a key that opens any door", "Would you rather Know the history of every object you touched or Be able to talk to animals", "Would you rather Be married to a 10 with a bad personality or Be a 6 with an amazing personality", "Would you rather Have all traffic lights you approach be green or Never have to stand in line again", "Would you rather Spend the rest of your life with a sailboat as your home or Have an RV as your home", "Would you rather Give up all drinks except for water or Give up eating anything that was cooked in an oven", "Would you rather Be able to see 10 minutes into your own future or Be able to see 10 minutes into the future of anyone but yourself", "Would you rather Have an easy job working for someone else or Work for yourself but work incredibly hard", "Would you rather Be the first person to explore a planet or Be the inventor of a drug that cures a deadly disease", "Would you rather Go back to age 5 with everything you know now or Know now everything your future self will learn", "Would you rather Be able to control animals (but not humans) with your mind or Be able to control electronics with your mind", "Would you rather Have unlimited international first-class tickets or Never have to pay for food at restaurants", "Would you rather See what was behind every closed door or Be able to guess the combination of every safe on the first try", "Would you rather Be an average person in the present or Be a king of a large country 2500 years ago", "Would you rather Be forced to dance every time you heard music or Be forced to sing along to any song you heard", "Would you rather 5 percent of the population have telepathy, or 5 percent of the population have telekinesis", "Would you rather Be completely insane and know that you are insane or Be completely insane and believe you are sane", "the holy roman empire was in no way holy, nor Roman, nor an empire", "what was a significant moment in your life", "where would you most like to visit", "what do you do to relieve stress", "what is the most useful thing you own", "who has been the most influential person on who you have become", "what is your superpower", "what is something on your bucket list", "what is a favorite story of yours: book, movie, other", "do you prefer traveling in a group or alone", "what is the longest you have sat and just let you mind wander; and if you remember, what did you think about", "if you could make one change to the world, what would it be; why, or what result would you hope for", "what personal goal do you have for yourself currently that you are working towards", "a portal opens in front of you, knowing that it is safe, but not where to, do you enter and why", "what moment in your life would you most like to relive with the knowledge you have now; and why", "when did a complete stranger do something nice for you", "would you rather be able to see 10 minutes into your own future or 10 minutes into the future of anyone but yourself", "would you rather go to jail for 4 years for something you did not do or get away with something horrible you did but always live in fear of being caught", "do you think that you would better fit in in a different place and time in history", "would you rather live in the wilderness, far from civilization, or live on the streets of a city as a homeless person", "what is your definition of greatness", "if you had to choose, would you rather be an inventor or an explorer", "would you rather receive one free international round-trip ticket per year, or unlimited round-trip tickets within one continent", "would you rather face your fears, or forget that you ever had them", "what was something that you did, knowing it was dangerous before doing it", "what movie genre would your life story best fit", "do you like to be saved, or do the saving", "what would you study if all of your monetary needs were covered by your efforts", "what would you tell your 15 year old self, if you could", "what was the best TV sitcom ever", "what makes you feel better if you are down", "how will our culture change in the next 100 years", "where would you most like to travel", "if you could appear on any game show which would you choose", "what have you lost that you’d most like to find", "do you tend to live in the past, present, or future", "what do you think is the ideal age", "what is the most beautiful place you’ve ever seen", "if you could spend the weekend in any city which would you choose", "what do you most admire about your parents", "if you needed to change your name what would you choose", "what is a simple pleasure you have or indulge in", "what was the best vacation you have ever been on", "if you could improve one characteristic of all humans what would you choose", "what is something you miss about childhood", "if you could receive a lesson from an expert who would that be and on what", "do you have any superstitions", "would you be likely to survive alone in the wilderness", "would you ever skydive or swim with sharks; what if you could be sure that you could not be harmed", "if money were no object, what kind of party would you throw", "what is your dream job", "if you knew that you were going to inherit a fortune how would your plans for the future change", "what do you dream your life will be like in 10 years", "where would you choose to live if you had to leave this country", "which accomplishment are you most proud of", "if you could master one musical instrument, which would you choose", "which book has dramatically influenced your life", "which of your ancestors would you most like to meet", "would you like to be proudest of your accomplishments or your character", "what posters did you have in your room when you were young", "how many different places have you lived", "what do you wish you were better at saying \"no\" to", "what is the biggest lie you told as a child", "what is your favorite part of thanksgiving dinner", "what fear would you like to conquer", "what dangerous thing would you do if there was no risk just once", "would you rather live by the beach or in the mountains", "is it more essential to develop beliefs or gain knowledge", "what is the worst job you have ever had", "in your golden years would you rather have a sharp mind or fit body", "would you rather meet your great great grandparents or your great great grandchildren", "what is the funniest advice someone has given you", "which is more important, intelligence or common sense", "who is the most optimistic person you know", "what is a favorite quote of yours", "which event in the past, present, or future would you like to witness in person", "have you ever bought anything from a TV infomercial", "what is the strangest thing you have ever eaten", "when you were young what did you want to be when you grew up", "who would you most like to meet in person", "what do you complain about more than anything else", "what is your favorite desert", "what is the hardest thing you have ever done", "would you rather be the worst player on a winning team or the best player on a losing team", "which is more important to humanity, science or art", "are you tougher, mentally or physically", "which language would you like to speak fluently", "what are the most important qualities in friends", "what did you get into trouble for when you were young", "is justice or forgiveness more important", "would you rather visit a big city or the countryside", "do you let the little things get in the way of the big things", "do you possess any of the qualities of your astrological sign", "who do you think is the most inspirational person alive today", "if you didnt have to worry about money what would you do with your life", "who is the best teacher you have had or known", "what was your favorite game as a child", "which of your personality traits would you like to change", "what was your most memorable meal ever", "who is a personal hero of yours", "what do you worry about in the middle of the night", "when you want to laugh who do you turn to", "is it harder to forgive yourself or others", "which makes you happiest: home, religion, income, marriage, community, or something else", "what is the best stress reliever you know", "how much are you influenced by others happiness or unhappiness", "do your morals ever get in the way of things you want to do", "when is the last time you took a big risk", "how could you be happier than you are now", "what would you like to give up thinking about", "what is your favorite way to distract yourself", "when are you most impatient", "does work contribute to your happiness or take away from it", "why do we spend time doing things that we know wont make us happy", "do you have unnecessarily high standards", "are you ever surprised by your own behavior", "when you shuht your eyes at night what do you think about", "if you were going to begin dancing regularly what style would you choose", "do you think it is easier to be happy when you dont have as many choices", "what is contributing a surpriseing amount of happiness to your life recently", "what is the hardest thing for you to resist", "when have you been happiest in your life", "have you seen your work suffer when you are unhappy", "where is the most unlikely place you have made a friend", "what are things that energize you; what are things that exhaust you", "what are some small daily things that give you pleasure", "which kinds of decisions exhaust you", "what are you most greatful for recently", "how do you determine if an experience is positive or negative", "what is the biggest change you have made this year", "what is your favorite daydream", "what is the best way you have found to deal with criticism", "how do you unnecessarily spend money", "what do you sometimes take for granted", "what gets you out of bed in the morning", "are you willing to ask for help when you need it", "what was the most creative time of your life", "do you spend more energy seeking appreciation or giving it", "what is the most persuasive outside influence on your life", "have you ever felt guilty for being happy", "do you accept what cant be changed", "do you bring energy into a room or suck it out", "which possession did you thinkn would make you happier than it actually did", "when do you get your best ideas", "what are your top three strengths", "do you find it difficult to moderate your emotions", "is the richest person you know significantly happier than you", "are you an open book", "what life event that you thought was going to be negative turned out to be positive", "which purchas egave you the worst case of buyers remorse", "if you could get rid of a daily noise from something what would it be", "do you have higher standards for yourself or other people", "are you letting any of your talents go to waste", "what are three important characteristics you look for in a partner", "would you rather be smarter, more athletic, or better-looking", "what's your favorite dessert", "in what language would you like to be fluent", "what's the best and worst thing about your position in the family birth order", "if you were leaving your state, which part of the country would you want to move to", "would you rather be a great musician, athlete, scientist, artist, politician, or writer", "if you were showing a foreigner around your town, where would you take them", "what personality trait has gotten you in the most trouble", "if you could master one instrument, what would you chooose", "would you travel into space if you could", "what one thing would you like to know about the future", "what's your favorite summertime activity", "would you choose to be the worst player on a winning team, or the best player on a losing team", "if you had the time and resources, what kind of volunteer work would you like to do", "what fear would you like to conquer", "do you believe animals have emotions", "in order of importance, how would you rank happiness, money, freedom, and love", "which famous athlete would you love to meet", "would you rather live for a week in the past or in the future", "what event in the past or future would you like to witness in person", "do you share any of your family's physical traits", "what would you like to learn to cook", "would you rather fly or be invisible", "what bedtime would you pick if you could choose", "would you rather be spanked or grounded", "what three things would you like to change in the world", "where would you choose to travel if money was no object", "would you prefer to have many acquaintances or a few very close friends", "what's the nicest thing you've ever done for someone", "have you ever stood up for something you thought was right", "how will you know when you're \"grown-up\"", "what would be on the menu for your ulitmate birthday dinner", "if you could, would you rather live in a boat or a tree house", "what's your favorite family tradition", "when you're having a bad day, what do you do to feel better", "which school subjects do you think will be useful and which will be useless", "which is more important, intelligence or common sense", "what nickname would you like", "what skill would you like to have someday", "what do you most admire about your parents", "what was your favorite family vacation", "which TV show would you pick to live inside for a week", "which gift would you prefer, a toy you've wanted or a vacation with your family", "what's your favorite ride at an amusement park", "what would you like to be doing in 10 years", "which animal would you love to be for a day", "what would be the best and worst things about having a twin", "which household chores do you like to do and which do you try to avoid", "what's the story behind your name", "what would you like to change about your school", "if you could go to the Olympics in one sport, which would you choose", "should kids be forced to try new foods", "if you could have any view from your bedroom window, what would it be", "what are the most important qualities you look for in friends", "what would you do for fun if you had to give up TV and electronic games", "if you were offered one million dollars could you get straight 'A's next year", "if you could rename yourself, what new name would you choose", "would you rather have a good but strict teacher or a less talented but fun one", "what one special talent would you like to have", "would you rather be an only child or have ten siblings", "are you more comfortable as a leader or a follower", "what family or school rule would you most like to change", "is it harder for you to eat healthy or get exercise", "how did your parents meet and fall in love", "what's one thing you've done that you'd like to erase", "who has the power to shape your ideas and beliefs", "how does a person become courageous", "what question would you ask your parents if they had to tell the truth", "what are the most imporant rights every person should have", "what's the best birthday party you can imagine", "what's your favorite story about an ancestor", "would you go to school if it were your choice", "what would you most like to ask God", "how is your family different from other families and does it bother you", "what makes something art", "what's the scariest thing that ever happened to you", "what's a good loser and are you one", "in what ways are you generous", "when was it most difficult to persevere when you wanted to quit", "what would your life be like if you had all of your wishes granted", "would you rather have no rules to live by or the rules you have to live by now", "what difficult experience in your life has made you a stronger person", "who do you sorely miss", "which of your ancestors would you like to meet", "when are old things better than new things", "where would you go if you were going to run away from home", "when is it ok to lie", "is space exploration important", "will you discipline your children in the same way you are disciplined", "how was your grandparent's childhood different from yours", "how is your personality like your mother's and how is it like your father's", "what do you think is the hardest part about being a kid and about being a parent", "how are you different from everyone else", "what's the ultimate ice cream sundae", "what's the first thing you'd do if you were president", "what would be the positives and negatives of having a new baby in your family", "what new person would you like to have as a friend", "what are the benefits of saving and or spending", "what's your proudest accomplishment", "would you give up junk food to live 10 years longer", "would you stick by a friend if they became disfigured", "what would you like to be famous for someday", "if you were going to create a new holiday, what would it be and how would people celebrate it", "is it better for parents to stay together or to separate if they're unhappy", "how did your family decide to settle in your hometown", "what one goal do you hope to accomplish this year", "what would you most like to do for someone else if you had the money and time", "what would you save first if your house caught fire", "what are the positives and negatives of being competitive", "if you lived during the Gold Rush, would you have journeyed west to strike it rich", "can you tell if someone is telling the truth or lying, and if so, how", "what do you like best and least about your life", "which character traits of your brother's and sister's would you like to have", "what's the best way to cure homesickness", "which of your five senses would you least want to give up", "why do you think people do or say mean things to others", "would you rather hang out with older or younger kids", "which wild animal would you like to tame and keep as a pet", "would you rather be a wealthy movie star or a poor scientist who cures cancer", "why would you rather be a girl or a boy", "if you had to live with another family for a year, which family would you choose", "what are the best ways for parents to show their children they love them", "what's the hardest thing you've ever done", "have you ever revealed a friend's secret and they found out", "who is one of your heroes and why do they inspire you", "would you keep a secret if you knew someone would get hurt if you did", "when you receive two invitations at the same time how do you decide which one to accept", "what strengths do you bring to your family and do you feel they are appreciated", "who do you think is the most imporant person alive today", "have you ever stuck up for someone when they needed an ally", "what do you most worry about", "what do you do when someone gives you a gift you already have", "what's your definition of integrity and do you have it", "what do children know more about than adults", "what historical sporting event would you like to attend", "who's the best teacher you've had", "if you could design and build a room of your own, what would it be like", "if you didn't have to worry about money, what would you do with your life", "what one goal do you hope to accomplish this year", "do you let the little things get in the way of the big things", "if you went on a volunteer vacation, who would you most like to help", "who do you think is the most inspirational person alive today", "who taught you how to ride a bike", "do you possess any of the qualities of your astrological sign", "would you rather visit a big city or the countryside", "what's your dream job", "if you knew that you were going to inherit a fortune, how would your plans for the future change", "which of your personality traits would you like to change", "what do you dream your life will be like in 10 years", "where would you choose to live if you had to leave this country", "what's your proudest accomplishment", "what makes a house a home", "what fashion trend you followed was very cool then, but now looks ridiculous", "if you could master one instrument, which would it be", "if you could have front row seats to any concert, who would you like to see", "if you could be brilliant in one subject, which would you choose", "what was your favorite childhood meal", "which historical time period would you most like to visit", "have you ever had an experience that led you to believe in angels or ghosts", "which book dramatically influenced your life", "which celebrity do people say you resemble", "if you could have any view from your back porch, what would it be", "would you stop eating all junk food to live five years longer", "who's the funniest person alive", "what's on your bucket list", "which fabulously impractical car would you like to own", "what three adjectives would your family use to describe you", "how would you like to spend your elder years", "if you could work as an assistant to anyone for a year, who would you choose", "would you prefer money for a housekeeper, cook, gardener, or personal secretary", "what was the best TV sitcom ever", "which of your ancestors would you most like to meet", "would you like to be proudest of your accomplishments or your character", "what posters did you have in your room when you were young", "how many different places have you lived", "what remains undone that you've wanted to get done for years", "what do you wish you were better at saying \"no\" to", "what's your biggest lie you told as a child", "what's your favorite part of Thanksgiving dinner", "what one fear would you like to conquer", "what was your grandmother's signature dish", "if you could do something dangerous just once with no risk, what would you do", "would you rather live by the beach or in the mountains", "if you decided to go on a spiritual journey, where would you go, and what would you do", "is it more essential to develop beliefs or gain knowledge", "what's the worst job you ever had", "if you lived to be one hundred, would you rather have a sharp mind or a fit body", "what's your favorite reality TV show", "would you rather meet your great great grandparents or your great great grandchildren", "if you could donate one million dollars to charity, which would you choose", "what household disaster happened to you", "what's the scariest movie of all time", "is justice or forgiveness more important", "what did you get into trouble for when you were young", "what's the secret to staying young", "what are the most important qualities in friends", "have you ever bought anything from a TV infomercial", "which language would you like to speak fluently", "are you mentally or physically tougher", "what's the most fun party you ever attended", "who would you like to trade places with for one month", "is science or art more essential to humanity", "is it more important to be book-smart or street-smart", "which is more important: the respect of your children or your parents", "would you choose to be the worst player on a winning team, or the best player on a losing team", "if you owned a boat, what name would you choose for it", "what's the hardest thing you've ever done", "what would you love to find at a yard sale", "which celebrity would you most like to see in person", "what are your favorite apps", "which American landmark would you most like to see", "what was your most memorable meal ever", "what's the strangest thing you've ever eaten", "which event in the past, present, or future would you like to witness in person", "what's the funniest advice your mother gave you", "which is more important: intelligence or common sense", "what's your favorite song to play in the car", "how do you define success", "what would you miss most about your home if you moved", "who's your favorite professional athlete", "who's the most optimistic person you know", "which piece of land would you preserve forever", "what's your favorite quotation", "what's the secret to having a good marriage", "what do you love about your hometown", "when you're down, what makes you feel better", "how will our culture change in the next 100 years", "where would you most like to travel", "if you could be any athlete for a single game, who would you choose", "what would you most like to learn how to do on a computer", "what pets have you had in your life", "if you could appear on any game show, which would you choose", "what have you lost that you'd like to find", "in your opinion, what are the seven wonders of the world", "what's the most amazing weather you've seen", "do you tend to live in the past, present, or future", "what do you think is the ideal age", "what's your favorite fast food meal", "what's the most beautiful place you've ever seen", "if you could spend the weekend in any city, which would you choose", "if you only had five more years to live, would you change anything about your life", "what do you most admire about your parents", "what's the most beautiful drive you've taken", "if you needed to change your name, what would you choose", "what changes have you made to reduce your impact on the environment", "what do you complain about more than anything else", "what change would you most like to make for your health", "what are your simple pleasures", "what was the best vacation you ever took", "what's your favorite dessert", "if you could give all human beings one virtue, which would you choose", "which historical sporting event would you like to witness", "would you rather age forward or backwards from this point", "what do you miss about childhood", "which country did your family come from", "in which activity would you like a lesson from an expert", "do you have any superstitions", "what cars has your family owned", "would you be likely to survive alone in the wilderness", "what obligation do you believe you have to your country", "if you got a tattoo, what would you get and where would you put it", "which sports team has the best mascot", "if you knew you wouldn't get hurt, would you rather skydive or view sharks from an underwater cage", "if money were no object, what kind of party would you throw", "in what era would you like to have grown up", "when you were young, what did you want to be when you grew up", "would you rather be a great musician, artist, or athlete", "what would you most like to do for someone else if you had the money and time", "what would you try if you had no fear", "what was your favorite game to play as a child"]